{
    "COMMON": { "CONFORMANCE_LEVEL": "Level" },
    "PRINCIPLE": {
        "1": {
            "TITLE": "Perceivable",
            "DESCRIPTION": "Information and user interface components must be presentable to users in ways they can perceive."
        },
        "2": {
            "TITLE": "Operable",
            "DESCRIPTION": "User interface components and navigation must be operable."
        },
        "3": {
            "TITLE": "Understandable",
            "DESCRIPTION": "Information and the operation of the user interface must be understandable."
        },
        "4": {
            "TITLE": "Robust",
            "DESCRIPTION": "Content must be robust enough that it can be interpreted by a wide variety of user agents, including assistive technologies."
        }
    },
    "GUIDELINE": {
        "1.1": {
            "TITLE": "Text Alternatives",
            "DESCRIPTION": "Provide text alternatives for any non-text content so that it can be changed into other forms people need, such as large print, braille, speech, symbols or simpler language."
        },
        "1.2": {
            "TITLE": "Time-based Media",
            "DESCRIPTION": "Provide alternatives for time-based media."
        },
        "1.3": {
            "TITLE": "Adaptable",
            "DESCRIPTION": "Create content that can be presented in different ways (for example simpler layout) without losing information or structure."
        },
        "1.4": {
            "TITLE": "Distinguishable",
            "DESCRIPTION": "Make it easier for users to see and hear content including separating foreground from background."
        },
        "2.1": {
            "TITLE": "Keyboard Accessible",
            "DESCRIPTION": "Make all functionality available from a keyboard."
        },
        "2.2": {
            "TITLE": "Enough Time",
            "DESCRIPTION": "Provide users enough time to read and use content."
        },
        "2.3": {
            "TITLE": "Seizures and Physical Reactions",
            "DESCRIPTION": "Do not design content in a way that is known to cause seizures or physical reactions."
        },
        "2.4": {
            "TITLE": "Navigable",
            "DESCRIPTION": "Provide ways to help users navigate, find content, and determine where they are."
        },
        "2.5": {
            "TITLE": "Input Modalities",
            "DESCRIPTION": "Make it easier for users to operate functionality through various inputs beyond keyboard."
        },
        "3.1": {
            "TITLE": "Readable",
            "DESCRIPTION": "Make text content readable and understandable."
        },
        "3.2": {
            "TITLE": "Predictable",
            "DESCRIPTION": "Make Web pages appear and operate in predictable ways."
        },
        "3.3": {
            "TITLE": "Input Assistance",
            "DESCRIPTION": "Help users avoid and correct mistakes."
        },
        "4.1": {
            "TITLE": "Compatible",
            "DESCRIPTION": "Maximize compatibility with current and future user agents, including assistive technologies."
        }
    },
    "SUCCESS_CRITERION": {
        "1.1.1": {
            "TITLE": "Non-text Content",
            "DESCRIPTION": "All non-text content that is presented to the user has a text alternative that serves the equivalent purpose, except for the situations listed below.",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "If non-text content is a control or accepts user input, then it has a name that describes its purpose. (Refer to Success Criterion 4.1.2 for additional requirements for controls and content that accepts user input.)",
                    "TITLE": "Controls, Input"
                },
                "2": {
                    "DESCRIPTION": "If non-text content is time-based media, then text alternatives at least provide descriptive identification of the non-text content. (Refer to Guideline 1.2 for additional requirements for media.)",
                    "TITLE": "Time-Based Media"
                },
                "3": {
                    "DESCRIPTION": "If non-text content is a test or exercise that would be invalid if presented in text, then text alternatives at least provide descriptive identification of the non-text content.",
                    "TITLE": "Test"
                },
                "4": {
                    "DESCRIPTION": "If non-text content is primarily intended to create a specific sensory experience, then text alternatives at least provide descriptive identification of the non-text content.",
                    "TITLE": "Sensory"
                },
                "5": {
                    "DESCRIPTION": "If the purpose of non-text content is to confirm that content is being accessed by a person rather than a computer, then text alternatives that identify and describe the purpose of the non-text content are provided, and alternative forms of CAPTCHA using output modes for different types of sensory perception are provided to accommodate different disabilities.",
                    "TITLE": "CAPTCHA"
                },
                "6": {
                    "DESCRIPTION": "If non-text content is pure decoration, is used only for visual formatting, or is not presented to users, then it is implemented in a way that it can be ignored by assistive technology.",
                    "TITLE": "Decoration, Formatting, Invisible"
                }
            }
        },
        "1.2.1": {
            "TITLE": "Audio-only and Video-only (Prerecorded)",
            "DESCRIPTION": "For prerecorded audio-only and prerecorded video-only media, the following are true, except when the audio or video is a media alternative for text and is clearly labeled as such:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "An alternative for time-based media is provided that presents equivalent information for prerecorded audio-only content.",
                    "TITLE": "Prerecorded Audio-only"
                },
                "2": {
                    "DESCRIPTION": "Either an alternative for time-based media or an audio track is provided that presents equivalent information for prerecorded video-only content.",
                    "TITLE": "Prerecorded Video-only"
                }
            }
        },
        "1.2.2": {
            "TITLE": "Captions (Prerecorded)",
            "DESCRIPTION": "Captions are provided for all prerecorded audio content in synchronized media, except when the media is a media alternative for text and is clearly labeled as such.",
            "DETAILS": {}
        },
        "1.2.3": {
            "TITLE": "Audio Description or Media Alternative (Prerecorded)",
            "DESCRIPTION": "An alternative for time-based media or audio description of the prerecorded video content is provided for synchronized media, except when the media is a media alternative for text and is clearly labeled as such.",
            "DETAILS": {}
        },
        "1.2.4": {
            "TITLE": "Captions (Live)",
            "DESCRIPTION": "Captions are provided for all live audio content in synchronized media.",
            "DETAILS": {}
        },
        "1.2.5": {
            "TITLE": "Audio Description (Prerecorded)",
            "DESCRIPTION": "Audio description is provided for all prerecorded video content in synchronized media.",
            "DETAILS": {}
        },
        "1.2.6": {
            "TITLE": "Sign Language (Prerecorded)",
            "DESCRIPTION": "Sign language interpretation is provided for all prerecorded audio content in synchronized media.",
            "DETAILS": {}
        },
        "1.2.7": {
            "TITLE": "Extended Audio Description (Prerecorded)",
            "DESCRIPTION": "Where pauses in foreground audio are insufficient to allow audio descriptions to convey the sense of the video, extended audio description is provided for all prerecorded video content in synchronized media.",
            "DETAILS": {}
        },
        "1.2.8": {
            "TITLE": "Media Alternative (Prerecorded)",
            "DESCRIPTION": "An alternative for time-based media is provided for all prerecorded synchronized media and for all prerecorded video-only media.",
            "DETAILS": {}
        },
        "1.2.9": {
            "TITLE": "Audio-only (Live)",
            "DESCRIPTION": "An alternative for time-based media that presents equivalent information for live audio-only content is provided.",
            "DETAILS": {}
        },
        "1.3.1": {
            "TITLE": "Info and Relationships",
            "DESCRIPTION": "Information, structure, and relationships conveyed through presentation can be programmatically determined or are available in text.",
            "DETAILS": {}
        },
        "1.3.2": {
            "TITLE": "Meaningful Sequence",
            "DESCRIPTION": "When the sequence in which content is presented affects its meaning, a correct reading sequence can be programmatically determined.",
            "DETAILS": {}
        },
        "1.3.3": {
            "TITLE": "Sensory Characteristics",
            "DESCRIPTION": "Instructions provided for understanding and operating content do not rely solely on sensory characteristics of components such as shape, color, size, visual location, orientation, or sound.",
            "DETAILS": {}
        },
        "1.3.4": {
            "TITLE": "Orientation",
            "DESCRIPTION": "Content does not restrict its view and operation to a single display orientation, such as portrait or landscape, unless a specific display orientation is essential.",
            "DETAILS": {}
        },
        "1.3.5": {
            "TITLE": "Identify Input Purpose",
            "DESCRIPTION": "The purpose of each input field collecting information about the user can be programmatically determined when:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "The input field serves a purpose identified in the Input Purposes for User Interface Components section; and"
                },
                "2": {
                    "DESCRIPTION": "The content is implemented using technologies with support for identifying the expected meaning for form input data."
                }
            }
        },
        "1.3.6": {
            "TITLE": "Identify Purpose",
            "DESCRIPTION": "In content implemented using markup languages, the purpose of User Interface Components, icons, and regions can be programmatically determined.",
            "DETAILS": {}
        },
        "1.4.1": {
            "TITLE": "Use of Color",
            "DESCRIPTION": "Color is not used as the only visual means of conveying information, indicating an action, prompting a response, or distinguishing a visual element.",
            "DETAILS": {}
        },
        "1.4.2": {
            "TITLE": "Audio Control",
            "DESCRIPTION": "If any audio on a Web page plays automatically for more than 3 seconds, either a mechanism is available to pause or stop the audio, or a mechanism is available to control audio volume independently from the overall system volume level.",
            "DETAILS": {}
        },
        "1.4.3": {
            "TITLE": "Contrast (Minimum)",
            "DESCRIPTION": "The visual presentation of text and images of text has a contrast ratio of at least 4.5:1, except for the following:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "Large-scale text and images of large-scale text have a contrast ratio of at least 3:1;",
                    "TITLE": "Large Text"
                },
                "2": {
                    "DESCRIPTION": "Text or images of text that are part of an inactive user interface component, that are pure decoration, that are not visible to anyone, or that are part of a picture that contains significant other visual content, have no contrast requirement.",
                    "TITLE": "Incidental"
                },
                "3": {
                    "DESCRIPTION": "Text that is part of a logo or brand name has no contrast requirement.",
                    "TITLE": "Logotypes"
                }
            }
        },
        "1.4.4": {
            "TITLE": "Resize text",
            "DESCRIPTION": "Except for captions and images of text, text can be resized without assistive technology up to 200 percent without loss of content or functionality.",
            "DETAILS": {}
        },
        "1.4.5": {
            "TITLE": "Images of Text",
            "DESCRIPTION": "If the technologies being used can achieve the visual presentation, text is used to convey information rather than images of text except for the following:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "The image of text can be visually customized to the user's requirements;",
                    "TITLE": "Customizable"
                },
                "2": {
                    "DESCRIPTION": "A particular presentation of text is essential to the information being conveyed.",
                    "TITLE": "Essential"
                }
            }
        },
        "1.4.6": {
            "TITLE": "Contrast (Enhanced)",
            "DESCRIPTION": "The visual presentation of text and images of text has a contrast ratio of at least 7:1, except for the following:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "Large-scale text and images of large-scale text have a contrast ratio of at least 4.5:1;",
                    "TITLE": "Large Text"
                },
                "2": {
                    "DESCRIPTION": "Text or images of text that are part of an inactive user interface component, that are pure decoration, that are not visible to anyone, or that are part of a picture that contains significant other visual content, have no contrast requirement.",
                    "TITLE": "Incidental"
                },
                "3": {
                    "DESCRIPTION": "Text that is part of a logo or brand name has no contrast requirement.",
                    "TITLE": "Logotypes"
                }
            }
        },
        "1.4.7": {
            "TITLE": "Low or No Background Audio",
            "DESCRIPTION": "For prerecorded audio-only content that (1) contains primarily speech in the foreground, (2) is not an audio CAPTCHA or audio logo, and (3) is not vocalization intended to be primarily musical expression such as singing or rapping, at least one of the following is true:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "The audio does not contain background sounds.",
                    "TITLE": "No Background"
                },
                "2": {
                    "DESCRIPTION": "The background sounds can be turned off.",
                    "TITLE": "Turn Off"
                },
                "3": {
                    "DESCRIPTION": "The background sounds are at least 20 decibels lower than the foreground speech content, with the exception of occasional sounds that last for only one or two seconds. NotePer the definition of \"decibel,\" background sound that meets this requirement will be approximately four times quieter than the foreground speech content.",
                    "TITLE": "20 dB"
                }
            }
        },
        "1.4.8": {
            "TITLE": "Visual Presentation",
            "DESCRIPTION": "For the visual presentation of blocks of text, a mechanism is available to achieve the following:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "Foreground and background colors can be selected by the user."
                },
                "2": {
                    "DESCRIPTION": "Width is no more than 80 characters or glyphs (40 if CJK)."
                },
                "3": {
                    "DESCRIPTION": "Text is not justified (aligned to both the left and the right margins)."
                },
                "4": {
                    "DESCRIPTION": "Line spacing (leading) is at least space-and-a-half within paragraphs, and paragraph spacing is at least 1.5 times larger than the line spacing."
                },
                "5": {
                    "DESCRIPTION": "Text can be resized without assistive technology up to 200 percent in a way that does not require the user to scroll horizontally to read a line of text on a full-screen window."
                }
            }
        },
        "1.4.9": {
            "TITLE": "Images of Text (No Exception)",
            "DESCRIPTION": "Images of text are only used for pure decoration or where a particular presentation of text is essential to the information being conveyed.",
            "DETAILS": {}
        },
        "1.4.10": {
            "TITLE": "Reflow",
            "DESCRIPTION": "Content can be presented without loss of information or functionality, and without requiring scrolling in two dimensions for:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "Vertical scrolling content at a width equivalent to 320 CSS pixels;"
                },
                "2": {
                    "DESCRIPTION": "Horizontal scrolling content at a height equivalent to 256 CSS pixels."
                }
            }
        },
        "1.4.11": {
            "TITLE": "Non-text Contrast",
            "DESCRIPTION": "The visual presentation of the following have a contrast ratio of at least 3:1 against adjacent color(s):",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "Visual information required to identify user interface components and states, except for inactive components or where the appearance of the component is determined by the user agent and not modified by the author;",
                    "TITLE": "User Interface Components"
                },
                "2": {
                    "DESCRIPTION": "Parts of graphics required to understand the content, except when a particular presentation of graphics is essential to the information being conveyed.",
                    "TITLE": "Graphical Objects"
                }
            }
        },
        "1.4.12": {
            "TITLE": "Text Spacing",
            "DESCRIPTION": "In content implemented using markup languages that support the following text style properties, no loss of content or functionality occurs by setting all of the following and by changing no other style property:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "Line height (line spacing) to at least 1.5 times the font size;"
                },
                "2": {
                    "DESCRIPTION": "Spacing following paragraphs to at least 2 times the font size;"
                },
                "3": {
                    "DESCRIPTION": "Letter spacing (tracking) to at least 0.12 times the font size;"
                },
                "4": {
                    "DESCRIPTION": "Word spacing to at least 0.16 times the font size."
                }
            }
        },
        "1.4.13": {
            "TITLE": "Content on Hover or Focus",
            "DESCRIPTION": "Where receiving and then removing pointer hover or keyboard focus triggers additional content to become visible and then hidden, the following are true:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "A mechanism is available to dismiss the additional content without moving pointer hover or keyboard focus, unless the additional content communicates an input error or does not obscure or replace other content;",
                    "TITLE": "Dismissible"
                },
                "2": {
                    "DESCRIPTION": "If pointer hover can trigger the additional content, then the pointer can be moved over the additional content without the additional content disappearing;",
                    "TITLE": "Hoverable"
                },
                "3": {
                    "DESCRIPTION": "The additional content remains visible until the hover or focus trigger is removed, the user dismisses it, or its information is no longer valid.",
                    "TITLE": "Persistent"
                }
            }
        },
        "2.1.1": {
            "TITLE": "Keyboard",
            "DESCRIPTION": "All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes, except where the underlying function requires input that depends on the path of the user's movement and not just the endpoints.",
            "DETAILS": {}
        },
        "2.1.2": {
            "TITLE": "No Keyboard Trap",
            "DESCRIPTION": "If keyboard focus can be moved to a component of the page using a keyboard interface, then focus can be moved away from that component using only a keyboard interface, and, if it requires more than unmodified arrow or tab keys or other standard exit methods, the user is advised of the method for moving focus away.",
            "DETAILS": {}
        },
        "2.1.3": {
            "TITLE": "Keyboard (No Exception)",
            "DESCRIPTION": "All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes.",
            "DETAILS": {}
        },
        "2.1.4": {
            "TITLE": "Character Key Shortcuts",
            "DESCRIPTION": "If a keyboard shortcut is implemented in content using only letter (including upper- and lower-case letters), punctuation, number, or symbol characters, then at least one of the following is true:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "A mechanism is available to turn the shortcut off;",
                    "TITLE": "Turn off"
                },
                "2": {
                    "DESCRIPTION": "A mechanism is available to remap the shortcut to include one or more non-printable keyboard keys (e.g., Ctrl, Alt);",
                    "TITLE": "Remap"
                },
                "3": {
                    "DESCRIPTION": "The keyboard shortcut for a user interface component is only active when that component has focus.",
                    "TITLE": "Active only on focus"
                }
            }
        },
        "2.2.1": {
            "TITLE": "Timing Adjustable",
            "DESCRIPTION": "For each time limit that is set by the content, at least one of the following is true:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "The user is allowed to turn off the time limit before encountering it; or",
                    "TITLE": "Turn off"
                },
                "2": {
                    "DESCRIPTION": "The user is allowed to adjust the time limit before encountering it over a wide range that is at least ten times the length of the default setting; or",
                    "TITLE": "Adjust"
                },
                "3": {
                    "DESCRIPTION": "The user is warned before time expires and given at least 20 seconds to extend the time limit with a simple action (for example, \"press the space bar\"), and the user is allowed to extend the time limit at least ten times; or",
                    "TITLE": "Extend"
                },
                "4": {
                    "DESCRIPTION": "The time limit is a required part of a real-time event (for example, an auction), and no alternative to the time limit is possible; or",
                    "TITLE": "Real-time Exception"
                },
                "5": {
                    "DESCRIPTION": "The time limit is essential and extending it would invalidate the activity; or",
                    "TITLE": "Essential Exception"
                },
                "6": {
                    "DESCRIPTION": "The time limit is longer than 20 hours.",
                    "TITLE": "20 Hour Exception"
                }
            }
        },
        "2.2.2": {
            "TITLE": "Pause, Stop, Hide",
            "DESCRIPTION": "For moving, blinking, scrolling, or auto-updating information, all of the following are true:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "For any moving, blinking or scrolling information that (1) starts automatically, (2) lasts more than five seconds, and (3) is presented in parallel with other content, there is a mechanism for the user to pause, stop, or hide it unless the movement, blinking, or scrolling is part of an activity where it is essential; and",
                    "TITLE": "Moving, blinking, scrolling"
                },
                "2": {
                    "DESCRIPTION": "For any auto-updating information that (1) starts automatically and (2) is presented in parallel with other content, there is a mechanism for the user to pause, stop, or hide it or to control the frequency of the update unless the auto-updating is part of an activity where it is essential.",
                    "TITLE": "Auto-updating"
                }
            }
        },
        "2.2.3": {
            "TITLE": "No Timing",
            "DESCRIPTION": "Timing is not an essential part of the event or activity presented by the content, except for non-interactive synchronized media and real-time events.",
            "DETAILS": {}
        },
        "2.2.4": {
            "TITLE": "Interruptions",
            "DESCRIPTION": "Interruptions can be postponed or suppressed by the user, except interruptions involving an emergency.",
            "DETAILS": {}
        },
        "2.2.5": {
            "TITLE": "Re-authenticating",
            "DESCRIPTION": "When an authenticated session expires, the user can continue the activity without loss of data after re-authenticating.",
            "DETAILS": {}
        },
        "2.2.6": {
            "TITLE": "Timeouts",
            "DESCRIPTION": "Users are warned of the duration of any user inactivity that could cause data loss, unless the data is preserved for more than 20 hours when the user does not take any actions.",
            "DETAILS": {}
        },
        "2.3.1": {
            "TITLE": "Three Flashes or Below Threshold",
            "DESCRIPTION": "Web pages do not contain anything that flashes more than three times in any one second period, or the flash is below the general flash and red flash thresholds.",
            "DETAILS": {}
        },
        "2.3.2": {
            "TITLE": "Three Flashes",
            "DESCRIPTION": "Web pages do not contain anything that flashes more than three times in any one second period.",
            "DETAILS": {}
        },
        "2.3.3": {
            "TITLE": "Animation from Interactions",
            "DESCRIPTION": "Motion animation triggered by interaction can be disabled, unless the animation is essential to the functionality or the information being conveyed.",
            "DETAILS": {}
        },
        "2.4.1": {
            "TITLE": "Bypass Blocks",
            "DESCRIPTION": "A mechanism is available to bypass blocks of content that are repeated on multiple Web pages.",
            "DETAILS": {}
        },
        "2.4.2": {
            "TITLE": "Page Titled",
            "DESCRIPTION": "Web pages have titles that describe topic or purpose.",
            "DETAILS": {}
        },
        "2.4.3": {
            "TITLE": "Focus Order",
            "DESCRIPTION": "If a Web page can be navigated sequentially and the navigation sequences affect meaning or operation, focusable components receive focus in an order that preserves meaning and operability.",
            "DETAILS": {}
        },
        "2.4.4": {
            "TITLE": "Link Purpose (In Context)",
            "DESCRIPTION": "The purpose of each link can be determined from the link text alone or from the link text together with its programmatically determined link context, except where the purpose of the link would be ambiguous to users in general.",
            "DETAILS": {}
        },
        "2.4.5": {
            "TITLE": "Multiple Ways",
            "DESCRIPTION": "More than one way is available to locate a Web page within a set of Web pages except where the Web Page is the result of, or a step in, a process.",
            "DETAILS": {}
        },
        "2.4.6": {
            "TITLE": "Headings and Labels",
            "DESCRIPTION": "Headings and labels describe topic or purpose.",
            "DETAILS": {}
        },
        "2.4.7": {
            "TITLE": "Focus Visible",
            "DESCRIPTION": "[Changed]",
            "DETAILS": {}
        },
        "2.4.8": {
            "TITLE": "Location",
            "DESCRIPTION": "Information about the user's location within a set of Web pages is available.",
            "DETAILS": {}
        },
        "2.4.9": {
            "TITLE": "Link Purpose (Link Only)",
            "DESCRIPTION": "A mechanism is available to allow the purpose of each link to be identified from link text alone, except where the purpose of the link would be ambiguous to users in general.",
            "DETAILS": {}
        },
        "2.4.10": {
            "TITLE": "Section Headings",
            "DESCRIPTION": "Section headings are used to organize the content.",
            "DETAILS": {}
        },
        "2.4.11": {
            "TITLE": "Focus Appearance (Minimum)",
            "DESCRIPTION": "[New]",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "Minimum area: The focus indication area is greater than or equal to a 1 CSS pixel border of the focused control, or has a thickness of at least 8 CSS pixels along the shortest side of the element."
                },
                "2": {
                    "DESCRIPTION": "Change of contrast: The color change for the focus indication area has a contrast ratio of at least 3:1 with the colors of the unfocused state."
                },
                "3": {
                    "DESCRIPTION": "Adjacent contrast: The focus indication area has a contrast ratio of at least 3:1 against all adjacent colors for the minimum area or greater, or has a thickness of at least 2 CSS pixels."
                },
                "4": {
                    "DESCRIPTION": "Unobscured: The item with focus is not entirely hidden by author-created content."
                }
            }
        },
        "2.4.12": {
            "TITLE": "Focus Appearance (Enhanced)",
            "DESCRIPTION": "[New]",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "Minimum area: The focus indication area is greater than or equal to a 2 CSS pixel solid border around the control."
                },
                "2": {
                    "DESCRIPTION": "Change of contrast: Color changes used to indicate focus have a contrast ratio of at least 4.5:1 with the colors changed from the unfocused control."
                },
                "3": {
                    "DESCRIPTION": "Unobscured: No part of the focus indicator is hidden by author-created content."
                }
            }
        },
        "2.4.13": {
            "TITLE": "Fixed Reference Points",
            "DESCRIPTION": "[New]",
            "DETAILS": {}
        },
        "2.5.1": {
            "TITLE": "Pointer Gestures",
            "DESCRIPTION": "All functionality that uses multipoint or path-based gestures for operation can be operated with a single pointer without a path-based gesture, unless a multipoint or path-based gesture is essential.",
            "DETAILS": {}
        },
        "2.5.2": {
            "TITLE": "Pointer Cancellation",
            "DESCRIPTION": "For functionality that can be operated using a single pointer, at least one of the following is true:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "The down-event of the pointer is not used to execute any part of the function;",
                    "TITLE": "No Down-Event"
                },
                "2": {
                    "DESCRIPTION": "Completion of the function is on the up-event, and a mechanism is available to abort the function before completion or to undo the function after completion;",
                    "TITLE": "Abort or Undo"
                },
                "3": {
                    "DESCRIPTION": "The up-event reverses any outcome of the preceding down-event;",
                    "TITLE": "Up Reversal"
                },
                "4": {
                    "DESCRIPTION": "Completing the function on the down-event is essential.",
                    "TITLE": "Essential"
                }
            }
        },
        "2.5.3": {
            "TITLE": "Label in Name",
            "DESCRIPTION": "For user interface components with labels that include text or images of text, the name contains the text that is presented visually.",
            "DETAILS": {}
        },
        "2.5.4": {
            "TITLE": "Motion Actuation",
            "DESCRIPTION": "Functionality that can be operated by device motion or user motion can also be operated by user interface components and responding to the motion can be disabled to prevent accidental actuation, except when:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "The motion is used to operate functionality through an accessibility supported interface;",
                    "TITLE": "Supported Interface"
                },
                "2": {
                    "DESCRIPTION": "The motion is essential for the function and doing so would invalidate the activity.",
                    "TITLE": "Essential"
                }
            }
        },
        "2.5.5": {
            "TITLE": "Target Size",
            "DESCRIPTION": "The size of the target for pointer inputs is at least 44 by 44 CSS pixels except when:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "The target is available through an equivalent link or control on the same page that is at least 44 by 44 CSS pixels;",
                    "TITLE": "Equivalent"
                },
                "2": {
                    "DESCRIPTION": "The target is in a sentence or block of text;",
                    "TITLE": "Inline"
                },
                "3": {
                    "DESCRIPTION": "The size of the target is determined by the user agent and is not modified by the author;",
                    "TITLE": "User Agent Control"
                },
                "4": {
                    "DESCRIPTION": "A particular presentation of the target is essential to the information being conveyed.",
                    "TITLE": "Essential"
                }
            }
        },
        "2.5.6": {
            "TITLE": "Concurrent Input Mechanisms",
            "DESCRIPTION": "Web content does not restrict use of input modalities available on a platform except where the restriction is essential, required to ensure the security of the content, or required to respect user settings.",
            "DETAILS": {}
        },
        "2.5.7": { "TITLE": "Dragging", "DESCRIPTION": "[New]", "DETAILS": {} },
        "2.5.8": {
            "TITLE": "Pointer Target Spacing",
            "DESCRIPTION": "[New]",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "Enlarge: A mechanism is available to change the CSS pixel size of each target, or its spacing, so there is an area with a width and height of at least 44 CSS pixels that includes it, and no other targets;"
                },
                "2": {
                    "DESCRIPTION": "Inline: The target is in a sentence or block of text;"
                },
                "3": {
                    "DESCRIPTION": "User agent: The size of the target is controlled by the user agent and is not modified by the author;"
                },
                "4": {
                    "DESCRIPTION": "Essential: A particular presentation of the target is essential to the information being conveyed."
                }
            }
        },
        "3.1.1": {
            "TITLE": "Language of Page",
            "DESCRIPTION": "The default human language of each Web page can be programmatically determined.",
            "DETAILS": {}
        },
        "3.1.2": {
            "TITLE": "Language of Parts",
            "DESCRIPTION": "The human language of each passage or phrase in the content can be programmatically determined except for proper names, technical terms, words of indeterminate language, and words or phrases that have become part of the vernacular of the immediately surrounding text.",
            "DETAILS": {}
        },
        "3.1.3": {
            "TITLE": "Unusual Words",
            "DESCRIPTION": "A mechanism is available for identifying specific definitions of words or phrases used in an unusual or restricted way, including idioms and jargon.",
            "DETAILS": {}
        },
        "3.1.4": {
            "TITLE": "Abbreviations",
            "DESCRIPTION": "A mechanism for identifying the expanded form or meaning of abbreviations is available.",
            "DETAILS": {}
        },
        "3.1.5": {
            "TITLE": "Reading Level",
            "DESCRIPTION": "When text requires reading ability more advanced than the lower secondary education level after removal of proper names and titles, supplemental content, or a version that does not require reading ability more advanced than the lower secondary education level, is available.",
            "DETAILS": {}
        },
        "3.1.6": {
            "TITLE": "Pronunciation",
            "DESCRIPTION": "A mechanism is available for identifying specific pronunciation of words where meaning of the words, in context, is ambiguous without knowing the pronunciation.",
            "DETAILS": {}
        },
        "3.2.1": {
            "TITLE": "On Focus",
            "DESCRIPTION": "When any user interface component receives focus, it does not initiate a change of context.",
            "DETAILS": {}
        },
        "3.2.2": {
            "TITLE": "On Input",
            "DESCRIPTION": "Changing the setting of any user interface component does not automatically cause a change of context unless the user has been advised of the behavior before using the component.",
            "DETAILS": {}
        },
        "3.2.3": {
            "TITLE": "Consistent Navigation",
            "DESCRIPTION": "Navigational mechanisms that are repeated on multiple Web pages within a set of Web pages occur in the same relative order each time they are repeated, unless a change is initiated by the user.",
            "DETAILS": {}
        },
        "3.2.4": {
            "TITLE": "Consistent Identification",
            "DESCRIPTION": "Components that have the same functionality within a set of Web pages are identified consistently.",
            "DETAILS": {}
        },
        "3.2.5": {
            "TITLE": "Change on Request",
            "DESCRIPTION": "Changes of context are initiated only by user request or a mechanism is available to turn off such changes.",
            "DETAILS": {}
        },
        "3.2.6": {
            "TITLE": "Findable Help",
            "DESCRIPTION": "[New]",
            "DETAILS": {
                "1": { "DESCRIPTION": "Human contact details;" },
                "2": { "DESCRIPTION": "Human contact mechanism;" },
                "3": { "DESCRIPTION": "Self-help option;" },
                "4": { "DESCRIPTION": "A fully automated contact mechanism." }
            }
        },
        "3.2.7": {
            "TITLE": "Hidden Controls",
            "DESCRIPTION": "[New]",
            "DETAILS": {}
        },
        "3.3.1": {
            "TITLE": "Error Identification",
            "DESCRIPTION": "If an input error is automatically detected, the item that is in error is identified and the error is described to the user in text.",
            "DETAILS": {}
        },
        "3.3.2": {
            "TITLE": "Labels or Instructions",
            "DESCRIPTION": "Labels or instructions are provided when content requires user input.",
            "DETAILS": {}
        },
        "3.3.3": {
            "TITLE": "Error Suggestion",
            "DESCRIPTION": "If an input error is automatically detected and suggestions for correction are known, then the suggestions are provided to the user, unless it would jeopardize the security or purpose of the content.",
            "DETAILS": {}
        },
        "3.3.4": {
            "TITLE": "Error Prevention (Legal, Financial, Data)",
            "DESCRIPTION": "For Web pages that cause legal commitments or financial transactions for the user to occur, that modify or delete user-controllable data in data storage systems, or that submit user test responses, at least one of the following is true:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "Submissions are reversible.",
                    "TITLE": "Reversible"
                },
                "2": {
                    "DESCRIPTION": "Data entered by the user is checked for input errors and the user is provided an opportunity to correct them.",
                    "TITLE": "Checked"
                },
                "3": {
                    "DESCRIPTION": "A mechanism is available for reviewing, confirming, and correcting information before finalizing the submission.",
                    "TITLE": "Confirmed"
                }
            }
        },
        "3.3.5": {
            "TITLE": "Help",
            "DESCRIPTION": "Context-sensitive help is available.",
            "DETAILS": {}
        },
        "3.3.6": {
            "TITLE": "Error Prevention (All)",
            "DESCRIPTION": "For Web pages that require the user to submit information, at least one of the following is true:",
            "DETAILS": {
                "1": {
                    "DESCRIPTION": "Submissions are reversible.",
                    "TITLE": "Reversible"
                },
                "2": {
                    "DESCRIPTION": "Data entered by the user is checked for input errors and the user is provided an opportunity to correct them.",
                    "TITLE": "Checked"
                },
                "3": {
                    "DESCRIPTION": "A mechanism is available for reviewing, confirming, and correcting information before finalizing the submission.",
                    "TITLE": "Confirmed"
                }
            }
        },
        "3.3.7": {
            "TITLE": "Accessible Authentication",
            "DESCRIPTION": "[New]",
            "DETAILS": {}
        },
        "3.3.8": {
            "TITLE": "Redundant entry",
            "DESCRIPTION": "[New]",
            "DETAILS": {
                "1": { "DESCRIPTION": "auto-populated, or" },
                "2": { "DESCRIPTION": "available for the user to select." }
            }
        },
        "4.1.1": {
            "TITLE": "Parsing",
            "DESCRIPTION": "In content implemented using markup languages, elements have complete start and end tags, elements are nested according to their specifications, elements do not contain duplicate attributes, and any IDs are unique, except where the specifications allow these features.",
            "DETAILS": {}
        },
        "4.1.2": {
            "TITLE": "Name, Role, Value",
            "DESCRIPTION": "For all user interface components (including but not limited to: form elements, links and components generated by scripts), the name and role can be programmatically determined; states, properties, and values that can be set by the user can be programmatically set; and notification of changes to these items is available to user agents, including assistive technologies.",
            "DETAILS": {}
        },
        "4.1.3": {
            "TITLE": "Status Messages",
            "DESCRIPTION": "In content implemented using markup languages, status messages can be programmatically determined through role or properties such that they can be presented to the user by assistive technologies without receiving focus.",
            "DETAILS": {}
        }
    }
}
