{"AUDIT":{"TITLE":"Stap 4: Toets de sample","INTRO":"Beschrijf de resultaten uit de evaluatie van de webpagina's geselecteerd in de vorige stap. Vergelijk de resultaten tussen de geordende pagina's en de willekeurig gekozen pagina's, en waar nodig pas de geselecteerde sample in de vorige stap aan. Meer informatie over deze stap is te vinden in <a href={{link_em_4}}>WCAG-EM Stap 4: Toets de sample</a>. <br> <strong>Opmerking:</strong> Voor elk WCAG 2.0 succescriterium, kunt u resultaten voor de volledige sample invullen, evenals resultaten voor specifieke pagina's. Om individuele resultaten in te vullen, selecteer pagina's onder 'Te evalueren sample' (in de linker kolom); vervolgens onder de succescriteria, kies 'Invoer voor per-pagina-resultaten weergeven'","HD_SAMPLE_SELECT":"Te evalueren sample","INF_AUDIT_SAMPLE":"In dit onderdeel vindt u de webpagina's uit de vorige stap. De webpagina's die in dit onderdeel geselecteerd worden zullen onder 'Invoer voor per-pagina-resultaten weergeven' worden weergegeven wanneer deze uitgeklapt is in het onderdeel 'Succescriteria om te evalueren'. U kunt per pagina, of meerdere webpagina's tegelijk weergeven. Met het linkicoon kunt u pagina's in een nieuw venster openen.","BTN_COMPLETE_SELECTED":"Markeer selectie als voltooid","BTN_UNCOMPLETE_SELECTED":"Markeer selectie als onvoltooid","BTN_OPEN_SELECTED":"Open geselecteerde pagina's","NO_SAMPLE":"Geen sample beschikbaar. Maak een sample in stap 2 en stap 3.","TESTED":"Getest","HD_CRITERIA":"Succescriteria om te evalueren","INF_AUDIT_CRITERIA":"In dit onderdeel vindt u de WCAG 2.0 succescriteria. Gebruik de filter om succescriteria van niveaus (A, AA en AAA) te tonen of verbergen. Kies 'Voldoende', 'Onvoldoende', 'Niet van toepassing', en 'Onbekend' als resultaat. U kunt bevindingen en andere opmerkingen uit de evaluatie in het tekstveld invullen.","FILTER":"Filter","PRINCIPLE":"Principe","NOTE":"Opmerking","BTN_SHOW_TEXT":"criteriumtekst weergeven","UNDERSTAND":"Toelichting","HOW_TO":"Hoe te voldoen","SAMPLE_FINDINGS":"Resultaat van de hele sample","BTN_EXPAND_PAGES":"Invoer voor per-pagina-resultaten weergeven","BTN_COLLAPSE_PAGES":"Invoer voor per-pagina-resultaten verbergen","LABEL_OUTCOME":"Uitkomst","UNTESTED":"{{critCount}} niet getest","NO_PAGE_SELECTED":"Geen pagina geselecteerd onder 'Te evalueren sample'","PLH_ASSERT_DESC":"Bevindingen uit de evaluatie","CLICK_TO_DELETE":"Klik om te verwijderen","LABEL_PAGE_HANDLE":"Korte paginatitel","SELECT_ALL":"Selecteer alle pagina's","RESULTS_FOR":"Uitkomst voor"},"COMMON":{"BROWSER_NOT_SUPPORTED":"Enkele functionaliteiten zijn niet door uw webbrowser ondersteund, zoals het opslaan en openen van rapporten. Je kunt de rapport tool met beperkte functionaliteit gebruiken. Update of gebruik een andere webbrowser om van alle functionaliteiten in de Report Tool gebruik te kunnen maken.","WARNING_BEFORE_UNLOAD":"Uw data worden niet automatisch opgeslagen. Wanneer het venster van uw web browser sluit is de data verloren. Gebruik de 'Opslaan' link (Ctrl + S of ⌘ S) bovenaan iedere pagina om uw data in een bestand op uw locale computer te bewaren en open deze later om door te werken.","MORE_INFO":"Voor meer informatie, zie <a href={{url}}>{{name}}</a>.","HIDE_MESSAGE":"Verberg bericht","BTN_INFO":"Info uitklappen","BTN_CLOSE_INFO":"Sluit info","YES":"Ja","NO":"Nee","CLICK_EXPAND":"Klik om sectie te tonen","CLICK_COLLAPSE":"Klik om sectie te verbergen","TO_TOP":"Naar boven"},"DOWNLOAD":{"TITLE":"Website Toegankelijkheid Evaluatie Rapport","INTRO":"Hieronder vindt u het evaluatierapport gebaseerd op de gegevens die u in vorige stappen heeft ingevuld. U kunt teruggaan naar vorige stappen voor verdere aanpassingen. U kunt de evaluatiedata downloaden zodat u hier later aan door kunt werken. (Hetzelfde als bij 'Opslaan'.) <br> Dit rapport is bedoeld als download. U kunt de HTML en CSS bestanden van het rapport hieronder downloaden. Daarna kunt u de presentatie en de inhoud van het rapport verder bewerken.","DOWNLOAD_REPORT":"Download het rapport","BTN_SAVE_HTML":"Download het evaluatierapport (HTML)","BTN_SAVE_CSS":"Download de stylesheet van het rapport (CSS)","BTN_SAVE_JSON":"Bewaar de evaluatiedata (JSON)"},"EARL":{"PASSED":"Voldoende","FAILED":"Onvoldoende","CANT_TELL":"Onbekend","NOT_PRESENT":"Niet van toepassing","NOT_CHECKED":"Niet getoetst","LEVEL_A":"Niveau A","LEVEL_AA":"Niveau AA","LEVEL_AAA":"Niveau AAA"},"ERROR":{"TITLE":"Oeps! Er ging iets mis","INTRO":"U bent op de verkeerde plek beland. Probeer een van de volgende oplossingen om het probleem op te lossen.","SUGGESTION1":"Als u de URL heeft getypet, controleer of deze juist is.","SUGGESTION2":"Ga <a href={{link_back}}>terug naar de vorige pagina</a> en probeer het nog eens.","SUGGESTION3":"Zorg dat de bestanden waarmee u werkt het <a href={{link_format}}>wcag-em format</a> volgen.","BUG_REPORT":"Om een bug of suggestie voor nieuwe functionaliteit te rapporteren laat een issue achter op onze <a href={{link_github}}>Github-projectpagina</a>."},"EXPLORE":{"TITLE":"Stap 2: Verken de te onderzoeken website","INTRO":"Verken de website om zo het doel en de functie van de website te achterhalen. Deze stap helpt u te bepalen welke webpagina's te bekijken in de volgende stappen. Achterhaal welke webtechnologieën in de website zijn gebruikt, en als u wilt, neem notities over belangrijke aspecten van de website. Het is gebruikelijk om voor deze stap input van de eigenaar en ontwikkelaars van de website mee te nemen. Meer informatie over deze stap vindt u in <a href={{link_em_2}}>WCAG-EM Stap 2: Verken de te onderzoeken website</a>.","HD_RELIEDUP_TECH":"technologieën waarop gesteund wordt","INF_RELIEDUP_TECH":"Bepaal op welke webtechnologieën de website steund <a href={{link_relied_upon}}>volgens WCAG 2.0</a>. Voor meer informatie, zie <a href={{link_em_2d}}>WCAG-EM Stap 2.d: Identificeer technologieën waarop gesteund wordt</a>.<br> Merk op: om andere technologieën toe te voegen, kies 'Anders' and gebruik de velden 'Webtechnologie' en 'Specificatie adres (URL)'. In het veld 'Specificatie adres (URL)' dient te verwijzen naar de specificatie van de technologie.","LABEL_TECH":"Webtechnologie","LABEL_TECH_SPEC":"Specificatie adres (URL)","PLH_TECH":"Bv. HTML5, CSS, DOM","PLH_TECH_SPEC":"Locatie (URL) of instructie naar de specificatie","BTN_REMOVE_TECH":"Webtechnologie verwijderen","BTN_ADD_TECH":"Webtechnologie toevoegen","HD_NOTE_TAKING":"Eventuele aantekeningen uit verkenning","INF_NOTE_TAKING":"In dit onderdeel kunt u aantekeningen zetten die u maakt bij het verkennen van de website. Deze aantekeningen kunt u in de volgende stap gebruiken om webpagina's voor de sample te selecteren voor de evaluatie. <strong>Deze notities komen niet in het eindrapport.</strong> Wel worden ze bewaard wanneer u het onderzoek opslaat en het bestand later opent.","LABEL_ESSENT_FUNC":"Functionaliteiten essentieel voor de website","INF_ESSENT_FUNC":"Gebruik dit veld om essentiële functionaliteiten van de website te noteren. Voorbeelden van essentiële functionaliteiten zijn: <br> 'Selecteer en bestel een product uit de webwinkel van de website'<br> 'Afronden en versturen van een formulier op de website'<br>'Een account op de website registreren'<br> Meer informatie vindt u in <a href={{link_em_2b}}>WCAG-EM Stap 2.b: Identificeer essentiële functionaliteiten van de website</a>","LABEL_VARIETY_PAGE_TYPES":"Diverse paginatypes","INF_VARIETY_PAGE_TYPES":"Gebruik dit veld om bij te houden welke diverse typen webpagina's u op de website heeft gevonden. Het gaat hier bijvoorbeeld om verschillende (opmaak)stijlen, layouts, indelingen en functionaliteiten op de website. Meer informatie vindt u in <a href={{link_em_2c}}>WCAG-EM Stap 2.c: Identificeer diverse paginatypes</a>.<br> Merk op: Een 'webpagina' kan in verschillende 'webpagina-toestanden' bestaan; zie de definitie <a href={{link_page_state}}>webpagina-toestanden</a>.","LABEL_OTHER":"Anders..."},"HTML_REPORT":{"BY":"Rapport auteur","COMMISION_BY":"Evaluatie opdrachtgever","HD_SUMMARY":"Samenvatting Evaluatieresultaten","HD_SCOPE":"Scope van de evaluatie","LABEL_SITE_NAME":"Website naam","LABEL_SITE_SCOPE":"Scope van de website","LABEL_CONFORMANCE_TGT":"Conformiteitsdoel","LABEL_EXTRA_REQUIREMENTS":"Verdere evaluatievereisten","LABEL_SUPPORT_BASE":"Basisniveau van toegankelijkheid ondersteund","LABEL_RELIEDUP_TECH":"technologieën waarop gesteund wordt","HD_SCORE":"Overzicht toetsresultaten","RESULTS_OF":"Resultaat voor","PRINCIPLE":"Principe","TOTAL_SCORE":"Totaal","HD_CRITERIA_REPORT":"Uitgebreide toetsresultaten","LABEL_DESCR":"Bevindingen","HD_SAMPLE":"Sample met getoetste webpagina's","HD_SPECIFICS":"Onderbouwing van de evaluatie","HD_DOCS":"Informatie over WCAG 2.0"},"NAV":{"MENU":"Menu","MENU_RESOURCES":"Relevante links","MENU_NEW":"Nieuw rapport","MENU_OPEN":"Open","MENU_SAVE":"Opslaan","MENU_SAVE_TITLE":"Ctrl + S of ⌘ S","MENU_LANGUAGE":"Taalkeuze","WZRD_LABEL":"Evaluatiestappen","WZRD_START":"Start","WZRD_SCOPE":"1. Bepaal Scope","WZRD_EXPLORE":"2. Verken Website","WZRD_SAMPLE":"3. Selecteer Sample","WZRD_AUDIT":"4. Toets Sample","WZRD_REPORT":"5. Rapporteer Resultaat","WZRD_ACTIVE":"Actief","WZRD_VIEWREPORT":"Bekijk Rapport","PREV_STEP":"Vorige stap","NEXT_STEP":"Volgende stap","STEP_START":"Start","STEP_SCOPE":"Bepaal scope","STEP_EXPLORE":"Verken website","STEP_SAMPLE":"Selecteer Sample","STEP_AUDIT":"Toets Sample","STEP_REPORT":"Rapporteer Resultaat","STEP_VIEWREPORT":"Bekijk Rapport","BTN_BACK_TO_EVAL":"Terug"},"OPEN":{"TITLE":"Open Evaluatierapport","INTRO":"Om een opgeslagen bestand opnieuw te openen, klik op 'Selecteer het evaluatie-databestand', en zoek het JSON bestand op dat u voorheen hebt opgeslagen.","LABEL_SELECT_FILE":"Selecteer het evaluatie-databestand","MSG_LOADING":"De evaluatie wordt geladen, even geduld a.u.b.","BTN_LOAD_FILE":"Open data uit geselecteerd bestand"},"REPORT":{"TITLE":"Stap 5: Evaluatiebevindingen rapporteren","INTRO":"Benoem verdere bevindingen uit de evaluatie die u in het rapport wilt hebben. De toetsresultaten uit de vorige stap vindt u onder 'Uitgebreide toetsresultaten' ter review en om u te helpen bij het schrijven van de samenvatting. Meer informatie over deze stap vindt u in <a href={{link_em_5}}>WCAG-EM Stap 5: Evaluatiebevindingen rapporteren</a>.","LABEL_TITLE":"Rapporttitel","TITLE_PREFIX":"Rapportage van","INF_TITLE":"Vul hier de titel in van het evaluatierapport van de toegankelijkheid van de website. Bijvoorbeeld: <br> 'Evaluatierapport voor Voorbeeldorganisatie' <br> 'Webshop Toegankelijkheidsanalyse en verbetersuggesties'","LABEL_COMMISSIONER":"Evaluatieopdrachtgever","INF_COMMISSIONER":"De persoon, het team, de organisatie, het departement of andere entiteit die opdracht voor de evaluatie gaf.","LABEL_CREATOR":"Evaluator","INF_CREATOR":"De persoon, het team, de organisatie, het departement of andere entiteit verantwoordelijk voor het uitvoeren van de evaluatie.","LABEL_DATE":"Evaluatiedatum","INF_DATE":"Vul hier de datum in waarop de evaluatie werd afgerond, of de datums waarop de evaluatie plaats vond. U kunt elk datumformaat gebruiken.","LABEL_SUMMARY":"Managementsamenvatting","INF_SUMMARY":"Geef een korte samenvatting van de bevindingen uit de evaluatie om zo een overzicht van de resultaten te krijgen. Benoem bijvoorbeeld de algehele toegankelijkheid van de website, met enkele concrete voorbeelden uit het onderzoek, zoals de frequentie van bepaalde verbeterpunten.","LABEL_SPECIFICS":"Benoem de onderbouwing van de evaluatie (optioneel)","INF_SPECIFICS":"WCAG-EM raadt aan dat u de getoetste webpagina's bewaart. Meer informatie hierover vindt u in <a href={{link_em_5b}}>WCAG-EM Stap 5.b: Benoem de onderbouwing van de evaluatie</a>. Gebruik dit tekstveld tevens om de gebruikte evaluatietools, webbrowsers, hulptechnologieën, andere software en toetsmethodes vast te leggen. Dit zal tevens in het eindrapport staan. U kunt deze informatie na het downloaden van het rapport als HTML-bestand nog bijwerken.","HD_CRITERIA_REPORT":"Uitgebreide toetsresultaten"},"SAMPLE":{"TITLE":"Stap 3: Selecteer een representatieve sample","INTRO":"Selecteer webpagina's voor de evaluatie. U vindt hier uw aantekeningen uit de vorige stap, om u te helpen webpagina's voor de sample te selecteren. Zorg ervoor dat de gekozen webpagina's representatief zijn voor de te toetsen website. Meer informatie over deze stap vindt u in <a href={{link_em_3}}>WCAG-EM Stap 3: Selecteer een representatieve sample</a>.","HD_STRUCT_SAMPLE":"Geordende sample","HD_ESSENT_FUNC":"Essentiële functionaliteiten (optionele notities uit vorige stap)","HD_VARIETY_PAGE_TYPES":"Diverse paginatypes (optionele notities uit vorige stap)","HD_STRUCT_SAMPLE_SUB":"Geordende samplepagina's","INF_STRUCT_SAMPLE":"Selecteer webpagina's representatief voor alle (1) veelgebruikte webpagina's, (2) essentiële functionaliteiten, (3) typen pagina's, (4) webtechnologieën waarop gesteund wordt, en (5) overige relevante pagina's. Meer informatie vindt u in <a href={{link_em_3a}}>WCAG-EM Stap 3.a: Gebruik een geordende sample</a>.<br> Opmerking: 'webpagina's' kunnen in verschillende 'toestanden' (states) bestaan; zie de definitie van <a href={{link_em_state}}>webpagina-toestand</a>","HD_RANDOM_SAMPLE":"Willekeurige sample","INF_RAND_SAMPLE":"Selecteer willekeurig samplepagina's; gebruik 10% van de grootte van de geordende sample. Meer informatie vindt u in <a href={{link_em_3b}}>WCAG-EM Stap 3.b: Gebruik een willekeurige sample</a>.<br> Opmerking: 'webpagina's' kunnen in verschillende 'toestanden' (states) bestaan; zie de definitie van <a href={{link_em_state}}>webpagina toestand</a>","RAND_SAMPLE_LENGTH":"Op basis van de geordende sample van {{total}} webpagina's, selecteer tenminste {{count}} willekeurige webpagina's (om te voldoen aan de 10% eis uit WCAG-EM).","LABEL_HANDLE":"korte titel","LABEL_PAGE":"Locatie (URL) of instructie","NO_PAGES_DEFINED":"Er is geen pagina in deze lijst","ITEM":"Webpagina","PLH_TITLE":"Identificerende naam voor de webpagina","PLH_PAGE_URL":"Locatie (URL) of instructie van het te volgen pad","BTN_ADD_PAGE":"Pagina toevoegen","BTN_REMOVE_PAGE":"Pagina verwijderen","STRUCTURED_PAGE":"Geordende pagina","RANDOM_PAGE":"Willekeurige pagina","SAMPLE_PAGE":"Samplepagina"},"SAVE":{"TITLE":"Evaluatierapport opslaan","INTRO":"Gebruik onderstaande link om de door u ingevoerde gegevens van het evaluatierapport als JSON databestand lokaal op uw computer te bewaren.","BTN_DOWNLOAD_DATA_FILE":"Bewaar databestand lokaal op uw computer","TIPS":"U kunt onvoltooide rapporten (en aantekeningen) bewaren en hier later aan verder werken. U kunt deze openen in iedere webbrowser en het databestand naar een andere computer sturen.<br> U dient uw werk regelmatig op te slaan om te voorkomen dat u werk verliest, mocht de webbrowser sluiten. U kunt de sneltoets Ctrl+S voor windows of ⌘S voor Mac gebruiken om het opslaan-scherm te starten (of om automatisch naar uw downloads folder te plaatsen, afhankelijk van uw browserinstellingen). <br> Wanneer u het evaluatierapport heeft afgerond, kunt u een HTML-bestand met het volledige rapport downloaden de <a href={{link_report}}>'Bekijk rapport'-pagina</a>."},"SCOPE":{"TITLE":"Stap 1: Bepaal de scope van de evaluatie","INTRO":"Bepaal de basiseisen en scope van de evaluatie. Dit wordt bij voorkeur gedaan door de opdrachtgever van de evaluatie (dit kan, maar hoeft niet de eigenaar van de website te zijn), om ervoor te zorgen dat de verwachtingen op de opdracht aansluiten. Meer informatie over deze stap vindt u in <a href={{link_step1}}>WCAG-EM Stap 1: Bepaal de scope van de evaluatie</a>.","LABEL_SITE_NAME":"Website naam","INF_SITE_NAME":"Vul een naam in van de te evalueren website. Bijvoorbeeld:<br> 'Publieke website van Voorbeeld Organisatie' <br> 'Webshop van Voorbeeld Bedrijf' <br> 'Intranet van Voorbeeld Universiteit'","LABEL_SITE_SCOPE":"Scope van de website","INF_SITE_SCOPE_0":"Leg de scope van de website vast, zodat duidelijk is welke webpagina's binnen de evaluatie vallen. Bijvoorbeeld:","INF_SITE_SCOPE_LI0":"'Alle webcontent van de publieke website van Voorbeeld Org. op http://www.example.org'","INF_SITE_SCOPE_LI1":"'Alle webcontent van de webwinkel van Voorbeeld Org. op http://www.example.org/shop/'","INF_SITE_SCOPE_LI2":"'Alle webcontent op de mobiele versie van de publieke website van Voorbeeld Org. op http://m.example.org'","INF_SITE_SCOPE_1":"WCAG-EM Stap 1.a: Definieer de scope van de website","LABEL_CONFORMANCE_TGT":"Conformiteitsdoel","INF_CONF_TGT":"Bepaal het te behalen WCAG 2.0 conformiteitsniveau ('A', 'AA' of 'AAA') voor de evaluatie. Voor meer informatie, zie <a href={{link_em_1b}}>WCAG-EM Stap 1.b: Bepaal het conformiteitsdoel</a>. Deze keuze bepaald welke niveaufilters in stap 4 standaard aan zullen staan.","LABEL_SUPPORT_BASE":"Basisniveau van toegankelijkheid-ondersteuning","INF_SUPPORT_BASE":"Bepaal welke webbrowser, hulptechnologieën en andere <a href={{link_user_agent}}>user agents</a> <a href={{link_access_supp}}>door toegankelijkheid ondersteund</a> zijn door de website. Bijvoorbeeld: 'Internet Explorer (IE) met JAWS', 'Firefox met NVDA', en 'iOS met VoiceOver' zou het basisniveau kunnen zijn. Voor meer informatie, zie <a href={{link_em_step1c}}>WCAG-EM Stap 1.c: Bepaal het Basisniveau van toegankelijkheid-ondersteuning</a>.","LABEL_EXTRA_REQUIREMENTS":"Verdere onderzoeksvereisten","INF_EXTRA_REQUIREMENTS_0":"Bepaal overige onderzoeksvereisten. Bijvoorbeeld:","INF_EXTRA_REQUIREMENTS_LI0":"'In het rapport wordt een volledige lijst van de gevonden problemen opgenomen, in plaats van slechts enkele voorbeelden'","INF_EXTRA_REQUIREMENTS_LI1":"'In het rapport zal een omschrijving van de problemen gegeven worden, samen met suggesties voor het oplossen van de problemen'","INF_EXTRA_REQUIREMENTS_LI2":"'Alle webpagina's en webcontent van de website zullen in de evaluatie getest worden, in plaats van enkel de steekproef","INF_EXTRA_REQUIREMENTS_1":"WCAG-EM Stap 1.d: Bepaal verdere onderzoeksvereisten"},"START":{"TITLE":"WCAG-EM Report Tool","SUBTITLE":"Website Toegankelijkheid Evaluatie Rapport Generator","INTRO_HD":"Wat de tool doet","INTRO_1":"Deze tool helpt u bij het maken van rapporten volgens de <a href={{link_wcagem}}>Website Accessibility Conformance Evaluation Methodology (WCAG-EM)</a>. Het voert geen toegankelijkheidstests voor u uit. Het begeleidt je door de stappen van WCAG-EM, om een <a href={{link_report}}>gestructureerd rapport</a> te genereren op basis van de gegevens die u invult. De tool is ontworpen voor ervaren inspecteurs bekend met <a href={{link_wcag}}>Richtlijnen voor Toegankelijkheid van Webcontent (WCAG) 2.0</a> en met enige kennis van WCAG-EM. U kunt een WCAG-EM introductie vinden in het <a href={{link_conformance}}>WCAG-EM Overzicht</a>.","INTRO_2":"<strong>Let op:</strong> Deze tool bewaart niet automatisch uw werk. U kunt uw gegevens lokaal op uw computer bewaren met de sneltoets Ctrl+S in windows, of {{mac}} op Mac. Dit start het opslaan scherm. (U kunt dit ook doen door de 'Opslaan' link bovenaan de pagina te klikken, en vervolgens op de link 'Bewaar databestand lokaal op uw computer' te klikken.)","USAGE_HD":"Hoe deze tool werkt","USAGE_LI1":"Alle functionaliteit is direct in uw webbrowser beschikbaar. U heeft geen internetverbinding nodig vanaf dit punt. Wanneer u het venster van de webbrowser sluit, raken gegevens die u niet heeft bewaard verloren.","USAGE_LI2":"Alle gegevens die u invult worden als JSON data op de achtergrond bewaard (in uw webbrowser, niet op een server). U kunt periodiek opslaan terwijl u werkt, om te voorkomen dat u data verliest mocht uw webbrowser sluiten.","USAGE_LI3":"U kunt tussentijdse rapporten bewaren en er later aan verder werken. Klik op de 'Open' link bovenin de pagina en laad daar het bestand dat u eerder hebt opgeslagen.","USAGE_LI4":"Links naar externe pagina's (buiten de tool) openen in een nieuw browser venster.","TIPS_HD":"Tips om de tool te gebruiken","TIPS_LI1":"U kunt heen en weer tussen de stappen schakelen. Geen van de velden is verplicht.","TIPS_LI2":"Voor meer informatie over een veld, klik op het {{info}} icoon naast het veld.","TIPS_LI3":"De tool creëert uw rapport als HTML en CSS bestanden. U kunt deze bestanden downloaden op de 'Bekijk rapport'-pagina. Daarna kunt u de presentatie en de inhoud van het rapport verder bewerken.","TIPS_LI4":"U kunt succescriteria aan uw WCAG 2.0 rapport toevoegen die hoger zijn dan het conformiteitsdoel. Bijvoorbeeld, de website dient aan niveau AA te voldoen, maar u wilt ook enkele AAA criteria in het rapport benoemen. In stap 4 kunt u de niveaufilter gebruiken om succescriteria van een hoger niveau te tonen. Criteria met een ingevuld resultaat zullen altijd in het rapport komen."}}