{
    "TITLE": "Stap 4: Toets de sample",
    "INTRO": "Beschrijf de resultaten uit de evaluatie van de webpagina's geselecteerd in de vorige stap. Vergelijk de resultaten tussen de geordende pagina's en de willekeurig gekozen pagina's, en waar nodig pas de geselecteerde sample in de vorige stap aan. Meer informatie over deze stap is te vinden in <a href={{link_em_4}}>WCAG-EM Stap 4: Toets de sample</a>. <br> <strong>Opmerking:</strong> Voor elk WCAG 2.0 succescriterium, kunt u resultaten voor de volledige sample invullen, evenals resultaten voor specifieke pagina's. Om individuele resultaten in te vullen, selecteer pagina's onder 'Te evalueren sample' (in de linker kolom); vervolgens onder de succescriteria, kies 'Invoer voor per-pagina-resultaten weergeven'",
    "HD_SAMPLE_SELECT": "Te evalueren sample",
    "INF_AUDIT_SAMPLE": "In dit onderdeel vindt u de webpagina's uit de vorige stap. De webpagina's die in dit onderdeel geselecteerd worden zullen onder 'Invoer voor per-pagina-resultaten weergeven' worden weergegeven wanneer deze uitgeklapt is in het onderdeel 'Succescriteria om te evalueren'. U kunt per pagina, of meerdere webpagina's tegelijk weergeven. Met het linkicoon kunt u pagina's in een nieuw venster openen.",
    "BTN_COMPLETE_SELECTED": "Markeer selectie als voltooid",
    "BTN_UNCOMPLETE_SELECTED": "Markeer selectie als onvoltooid",
    "BTN_OPEN_SELECTED": "Open geselecteerde pagina's",
    "NO_SAMPLE": "Geen sample beschikbaar. Maak een sample in stap 2 en stap 3.",
    "TESTED": "Getest",
    "HD_CRITERIA": "Succescriteria om te evalueren",
    "INF_AUDIT_CRITERIA": "In dit onderdeel vindt u de WCAG 2.0 succescriteria. Gebruik de filter om succescriteria van niveaus (A, AA en AAA) te tonen of verbergen. Kies 'Voldoende', 'Onvoldoende', 'Niet van toepassing', en 'Onbekend' als resultaat. U kunt bevindingen en andere opmerkingen uit de evaluatie in het tekstveld invullen.",
    "FILTER": "Filter",
    "PRINCIPLE": "Principe",
    "NOTE": "Opmerking",
    "BTN_SHOW_TEXT": "criteriumtekst weergeven",
    "UNDERSTAND": "Toelichting",
    "HOW_TO": "Hoe te voldoen",
    "SAMPLE_FINDINGS": "Resultaat van de hele sample",
    "BTN_EXPAND_PAGES": "Invoer voor per-pagina-resultaten weergeven",
    "BTN_COLLAPSE_PAGES": "Invoer voor per-pagina-resultaten verbergen",
    "LABEL_OUTCOME": "Uitkomst",
    "UNTESTED": "{{critCount}} niet getest",
    "NO_PAGE_SELECTED": "Geen pagina geselecteerd onder 'Te evalueren sample'",
    "PLH_ASSERT_DESC": "Bevindingen uit de evaluatie",
    "CLICK_TO_DELETE": "Klik om te verwijderen",
    "LABEL_PAGE_HANDLE": "Korte paginatitel",
    "SELECT_ALL": "Selecteer alle pagina's",
    "RESULTS_FOR": "Uitkomst voor"
}