{
    "TITLE": "Stap 2: Verken de te onderzoeken website",
    "INTRO": "Verken de website om zo het doel en de functie van de website te achterhalen. Deze stap helpt u te bepalen welke webpagina's te bekijken in de volgende stappen. Achterhaal welke webtechnologieën in de website zijn gebruikt, en als u wilt, neem notities over belangrijke aspecten van de website. Het is gebruikelijk om voor deze stap input van de eigenaar en ontwikkelaars van de website mee te nemen. Meer informatie over deze stap vindt u in {0}.",
    "INTRO_0": "WCAG-EM Stap 2: Verken de te onderzoeken website",
    "HD_RELIEDUP_TECH": "technologieën waarop gesteund wordt",
    "INF_RELIEDUP_TECH": "Bepaal met welke webtechnologieën de website wordt geleverd. Voor meer informatie, zie {0}.\n Merk op: om andere technologieën toe te voegen, kies 'Anders' and gebruik de velden 'Webtchnologie' en 'Specificatie adres (URL)'. In het veld 'Specificatie adres (URL)' dient te verwijzen naar de specificatie van de technologie.",
    "INF_RELIEDUP_TECH_0": "WCAG-EM Stap 2.d: Bepaal de technologieën waarop gesteund wordt",
    "INF_RELIEDUP_TECH_1": "definitie van 'gesteund wordt' in WCAG 2.0",
    "LABEL_TECH": "Webtechnologie",
    "LABEL_TECH_SPEC": "Specificatie adres (URL)",
    "PLH_TECH": "Bv. HTML5, CSS, DOM",
    "PLH_TECH_SPEC": "Address (URL) of omschrijving van de specificatie",
    "BTN_REMOVE_TECH": "Webtechnologie verwijderen",
    "BTN_ADD_TECH": "Webtechnologie toevoegen",

    "NO_TECH_DEFINED": "No relied upon technologies defined for this list",
    "HD_NOTE_TAKING": "Optional Exploration Notes",
    "INF_NOTE_TAKING": "This section lets you record information during your website exploration. These notes are provided in the next step, to help you select a sample of web pages for evaluation. <strong>These notes are not included in the final report.</strong> They are saved when you save the file, and available when you later reload the file",
    "LABEL_ESSENT_FUNC": "Essential functionality of the website",
    "INF_ESSENT_FUNC": "You can use this field to take notes about essential functionality of the website. Examples of essential functionality include:\n 'selecting and purchasing a product from the shop area of the website'\n 'completing and submitting a form provided on the website'\n 'registering for an account on the website'\n For more information, see {0}.",
    "INF_ESSENT_FUNC_0": "WCAG-EM Step 2.b: Identify Essential Functionality of the Website",
    "LABEL_VARIETY_PAGE_TYPES": "Variety of web page types",
    "INF_VARIETY_PAGE_TYPES": "You can use this field to take notes about the types (as opposed to instances) of web pages that you find on the web site. This includes notes about different styles, layouts, structures, and functionality provided on the website. For more information, see {0}.\n Note: 'Web pages' include different 'web page states'; see definition of {1}.",
    "INF_VARIETY_PAGE_TYPES_0": "WCAG-EM Step 2.c: Identify the Variety of Web Page Types",
    "INF_VARIETY_PAGE_TYPES_1": "webpagina states",
    "LABEL_OTHER": "Anders..."
}