{
    "TITLE": "Stap 2: Verken de te onderzoeken website",
    "INTRO": "Verken de website om zo het doel en de functie van de website te achterhalen. Deze stap helpt u te bepalen welke webpagina's te bekijken in de volgende stappen. Achterhaal welke webtechnologieën in de website zijn gebruikt, en als u wilt, neem notities over belangrijke aspecten van de website. Het is gebruikelijk om voor deze stap input van de eigenaar en ontwikkelaars van de website mee te nemen. Meer informatie over deze stap vindt u in <a href={{link_em_2}}>WCAG-EM Stap 2: Verken de te onderzoeken website</a>.",
    "HD_RELIEDUP_TECH": "technologieën waarop gesteund wordt",
    "INF_RELIEDUP_TECH": "Bepaal op welke webtechnologieën de website steund <a href={{link_relied_upon}}>volgens WCAG 2.0</a>. Voor meer informatie, zie <a href={{link_em_2d}}>WCAG-EM Stap 2.d: Identificeer technologieën waarop gesteund wordt</a>.<br> Merk op: om andere technologieën toe te voegen, kies 'Anders' and gebruik de velden 'Webtechnologie' en 'Specificatie adres (URL)'. In het veld 'Specificatie adres (URL)' dient te verwijzen naar de specificatie van de technologie.",
    "LABEL_TECH": "Webtechnologie",
    "LABEL_TECH_SPEC": "Specificatie adres (URL)",
    "PLH_TECH": "Bv. HTML5, CSS, DOM",
    "PLH_TECH_SPEC": "Locatie (URL) of instructie naar de specificatie",
    "BTN_REMOVE_TECH": "Webtechnologie verwijderen",
    "BTN_ADD_TECH": "Webtechnologie toevoegen",
    "HD_NOTE_TAKING": "Eventuele aantekeningen uit verkenning",
    "INF_NOTE_TAKING": "In dit onderdeel kunt u aantekeningen zetten die u maakt bij het verkennen van de website. Deze aantekeningen kunt u in de volgende stap gebruiken om webpagina's voor de sample te selecteren voor de evaluatie. <strong>Deze notities komen niet in het eindrapport.</strong> Wel worden ze bewaard wanneer u het onderzoek opslaat en het bestand later opent.",
    "LABEL_ESSENT_FUNC": "Functionaliteiten essentieel voor de website",
    "INF_ESSENT_FUNC": "Gebruik dit veld om essentiële functionaliteiten van de website te noteren. Voorbeelden van essentiële functionaliteiten zijn: <br> 'Selecteer en bestel een product uit de webwinkel van de website'<br> 'Afronden en versturen van een formulier op de website'<br>'Een account op de website registreren'<br> Meer informatie vindt u in <a href={{link_em_2b}}>WCAG-EM Stap 2.b: Identificeer essentiële functionaliteiten van de website</a>",
    "LABEL_VARIETY_PAGE_TYPES": "Diverse paginatypes",
    "INF_VARIETY_PAGE_TYPES": "Gebruik dit veld om bij te houden welke diverse typen webpagina's u op de website heeft gevonden. Het gaat hier bijvoorbeeld om verschillende (opmaak)stijlen, layouts, indelingen en functionaliteiten op de website. Meer informatie vindt u in <a href={{link_em_2c}}>WCAG-EM Stap 2.c: Identificeer diverse paginatypes</a>.<br> Merk op: Een 'webpagina' kan in verschillende 'webpagina-toestanden' bestaan; zie de definitie <a href={{link_page_state}}>webpagina-toestanden</a>.",
    "LABEL_OTHER": "Anders..."
}