{
    "TITLE": "Stap 1: Bepaal de scope van de evaluatie",
    "INTRO": "Bepaal de basiseisen en scope van de evaluatie. Dit wordt bij voorkeur gedaan door de opdrachtgever van de evaluatie (dit kan, maar hoeft niet de eigenaar van de website te zijn), om ervoor te zorgen dat de verwachtingen op de opdracht aansluiten. Meer informatie over deze stap vindt u in <a href={{link_step1}}>WCAG-EM Stap 1: Bepaal de scope van de evaluatie</a>.",
    "LABEL_SITE_NAME": "Website naam",
    "INF_SITE_NAME": "Vul een naam in van de te evalueren website. Bijvoorbeeld:<br> 'Publieke website van Voorbeeld Organisatie' <br> 'Webshop van Voorbeeld Bedrijf' <br> 'Intranet van Voorbeeld Universiteit'",
    "LABEL_SITE_SCOPE": "Scope van de website",
    "INF_SITE_SCOPE_0": "Leg de scope van de website vast, zodat duidelijk is welke webpagina's binnen de evaluatie vallen. Bijvoorbeeld:",
    "INF_SITE_SCOPE_LI0": "'Alle webcontent van de publieke website van Voorbeeld Org. op http://www.example.org'",
    "INF_SITE_SCOPE_LI1": "'Alle webcontent van de webwinkel van Voorbeeld Org. op http://www.example.org/shop/'",
    "INF_SITE_SCOPE_LI2": "'Alle webcontent op de mobiele versie van de publieke website van Voorbeeld Org. op http://m.example.org'",
    "INF_SITE_SCOPE_1": "WCAG-EM Stap 1.a: Definieer de scope van de website",
    "LABEL_CONFORMANCE_TGT": "Conformiteitsdoel",
    "INF_CONF_TGT": "Bepaal het te behalen WCAG 2.0 conformiteitsniveau ('A', 'AA' of 'AAA') voor de evaluatie. Voor meer informatie, zie <a href={{link_em_1b}}>WCAG-EM Stap 1.b: Bepaal het conformiteitsdoel</a>. Deze keuze bepaald welke niveaufilters in stap 4 standaard aan zullen staan.",
    "LABEL_SUPPORT_BASE": "Basisniveau van toegankelijkheid-ondersteuning",
    "INF_SUPPORT_BASE": "Bepaal welke webbrowser, hulptechnologieën en andere <a href={{link_user_agent}}>user agents</a> <a href={{link_access_supp}}>door toegankelijkheid ondersteund</a> zijn door de website. Bijvoorbeeld: 'Internet Explorer (IE) met JAWS', 'Firefox met NVDA', en 'iOS met VoiceOver' zou het basisniveau kunnen zijn. Voor meer informatie, zie <a href={{link_em_step1c}}>WCAG-EM Stap 1.c: Bepaal het Basisniveau van toegankelijkheid-ondersteuning</a>.",
    "LABEL_EXTRA_REQUIREMENTS": "Verdere onderzoeksvereisten",
    "INF_EXTRA_REQUIREMENTS_0": "Bepaal overige onderzoeksvereisten. Bijvoorbeeld:",
    "INF_EXTRA_REQUIREMENTS_LI0": "'In het rapport wordt een volledige lijst van de gevonden problemen opgenomen, in plaats van slechts enkele voorbeelden'",
    "INF_EXTRA_REQUIREMENTS_LI1": "'In het rapport zal een omschrijving van de problemen gegeven worden, samen met suggesties voor het oplossen van de problemen'",
    "INF_EXTRA_REQUIREMENTS_LI2": "'Alle webpagina's en webcontent van de website zullen in de evaluatie getest worden, in plaats van enkel de steekproef",
    "INF_EXTRA_REQUIREMENTS_1": "WCAG-EM Stap 1.d: Bepaal verdere onderzoeksvereisten",
    "WCAG21": "WCAG 2.1",
    "WCAG20": "WCAG 2.0"
}
