{
    "TITLE": "WCAG-EM Report Tool",
    "SUBTITLE": "Website Toegankelijkheid Evaluatie Rapport Generator",
    "INTRO_HD": "Wat de tool doet",
    "INTRO_1": "Deze tool helpt u bij het maken van rapporten volgens de <a href={{link_wcagem}}>Website Accessibility Conformance Evaluation Methodology (WCAG-EM)</a>. Het voert geen toegankelijkheidstests voor u uit. Het begeleidt je door de stappen van WCAG-EM, om een <a href={{link_report}}>gestructureerd rapport</a> te genereren op basis van de gegevens die u invult. De tool is ontworpen voor ervaren inspecteurs bekend met <a href={{link_wcag}}>Richtlijnen voor Toegankelijkheid van Webcontent (WCAG) 2.0</a> en met enige kennis van WCAG-EM. U kunt een WCAG-EM introductie vinden in het <a href={{link_conformance}}>WCAG-EM Overzicht</a>.",
    "INTRO_2": "<strong>Let op:</strong> Deze tool bewaart niet automatisch uw werk. U kunt uw gegevens lokaal op uw computer bewaren met de sneltoets Ctrl+S in windows, of {{mac}} op Mac. Dit start het opslaan scherm. (U kunt dit ook doen door de 'Opslaan' link bovenaan de pagina te klikken, en vervolgens op de link 'Bewaar databestand lokaal op uw computer' te klikken.)",
    "USAGE_HD": "Hoe deze tool werkt",
    "USAGE_LI1": "Alle functionaliteit is direct in uw webbrowser beschikbaar. U heeft geen internetverbinding nodig vanaf dit punt. Wanneer u het venster van de webbrowser sluit, raken gegevens die u niet heeft bewaard verloren.",
    "USAGE_LI2": "Alle gegevens die u invult worden als JSON data op de achtergrond bewaard (in uw webbrowser, niet op een server). U kunt periodiek opslaan terwijl u werkt, om te voorkomen dat u data verliest mocht uw webbrowser sluiten.",
    "USAGE_LI3": "U kunt tussentijdse rapporten bewaren en er later aan verder werken. Klik op de 'Open' link bovenin de pagina en laad daar het bestand dat u eerder hebt opgeslagen.",
    "USAGE_LI4": "Links naar externe pagina's (buiten de tool) openen in een nieuw browser venster.",
    "TIPS_HD": "Tips om de tool te gebruiken",
    "TIPS_LI1": "U kunt heen en weer tussen de stappen schakelen. Geen van de velden is verplicht.",
    "TIPS_LI2": "Voor meer informatie over een veld, klik op het {{info}} icoon naast het veld.",
    "TIPS_LI3": "De tool creëert uw rapport als HTML en CSS bestanden. U kunt deze bestanden downloaden op de 'Bekijk rapport'-pagina. Daarna kunt u de presentatie en de inhoud van het rapport verder bewerken.",
    "TIPS_LI4": "U kunt succescriteria aan uw WCAG 2.0 rapport toevoegen die hoger zijn dan het conformiteitsdoel. Bijvoorbeeld, de website dient aan niveau AA te voldoen, maar u wilt ook enkele AAA criteria in het rapport benoemen. In stap 4 kunt u de niveaufilter gebruiken om succescriteria van een hoger niveau te tonen. Criteria met een ingevuld resultaat zullen altijd in het rapport komen."
}