{
    "ASSERTION_RESULT_DESCRIPTION_LABEL": "Observações",
    "ASSERTION_RESULT_DESCRIPTION_PLACEHOLDER": "Observações feitas durante a avaliação",
    "BTN_COLLAPSE_PAGES": "Ocultar páginas web para inserir resultados individuais",
    "BTN_COMPLETE_SELECTED": "Defina selecionado para concluir",
    "BTN_EXPAND_PAGES": "Mostrar páginas da web para inserir resultados individuais",
    "BTN_OPEN_SELECTED": "Abrir páginas selecionadas",
    "BTN_SHOW_TEXT": "Mostrar texto do critério",
    "BTN_UNCOMPLETE_SELECTED": "Definir selecionado como incompleto",
    "CLICK_TO_DELETE": "Clique para deletar",
    "FILTER_LEVEL_LEGEND": "Exibir o nível de conformidade",
    "FILTER_NEW_IN_WCAG21": "Adicionado na WCAG 2.1",
    "FILTER_VERSION_LEGEND": "Exibir versão",
    "FILTER": "Exibir",
    "HD_CRITERIA": "Critérios de Sucesso para Avaliar",
    "HD_SAMPLE_SELECT": "Amostra para avaliar",
    "HOW_TO": "Como cumprir",
    "INF_AUDIT_CRITERIA": "Esta seção lista os critérios de sucesso das WCAG 2. Use o filtro para mostrar ou ocultar critérios de sucesso de diferentes níveis (A, AA e AAA). Você pode selecionar resultados como: 'Não marcado', 'Aprovado', 'Falha', 'Não presente' e 'Não sei'; e você pode fornecer detalhes, comentários ou outras observações feitas durante a avaliação na caixa de texto que o acompanha.",
    "INF_AUDIT_SAMPLE": "Esta seção lista as páginas da web que você selecionou na etapa anterior. As páginas da web marcadas nesta seção são listadas quando 'Mostrar páginas da web para inserir resultados individuais' é ativado na seção 'Critérios de sucesso a serem avaliados'. Você pode mostrar uma página da web individual que está avaliando ou mostrar várias páginas da web ao mesmo tempo. <br> O ícone de link abre a página da web em uma janela separada do navegador.",
    "INTRO": "Registre o resultado da avaliação das páginas da web selecionadas na etapa anterior. Compare os resultados entre a página estruturada e as páginas selecionadas aleatoriamente e, se necessário, ajuste a amostra selecionada na etapa anterior. Mais orientações sobre esta etapa são fornecidas na <a href={{link_em_4}}> Etapa 4 da WCAG-EM: Auditar a amostra selecionada </a>. <br> <strong> Nota: </strong> Para cada critério de sucesso das WCAG 2, você pode inserir 'Resultados para toda a amostra' e os resultados para páginas da web individuais. Você pode optar por inserir um ou ambos. Para inserir resultados individuais, selecione a (s) página (s) da web em 'Amostra a avaliar' (na coluna esquerda); em seguida, sob os critérios de sucesso específicos, selecione 'Mostrar páginas da web para inserir resultados individuais'",
    "LABEL_OUTCOME": "Resultado",
    "LABEL_PAGE_HANDLE": "Nome curto da página",
    "NO_PAGE_SELECTED": "Nenhuma página selecionada em Amostra para avaliar",
    "NO_SAMPLE": "Nenhuma amostra disponível. Crie uma amostra nas etapas 2 e 3.",
    "NOTE": "Nota",
    "PRINCIPLE": "Príncipio",
    "RESULTS_FOR": "Resultados para",
    "SAMPLE_FINDINGS": "Resultados para toda a amostra",
    "SELECT_ALL": "Selecione todas as páginas",
    "TESTED": "Testado",
    "TITLE": "Etapa 4: Auditar a amostra selecionada",
    "UNDERSTAND": "Compreensão",
    "UNTESTED": "{{critCount}} não testado"
}
