{
    "TITLE": "Etapa 4: Auditar a amostra selecionada",
    "INTRO": "Registre o resultado da avaliação das páginas selecionadas na etapa anterior. Compare os resultados entre a página estruturada e as páginas selecionadas aleatoriamente e, se necessário, ajuste a amostra selecionada na etapa anterior. Mais orientação sobre esta etapa é fornecido na <a href={{link_em_4}}> Etapa 4 da WCAG-EM: auditar a amostra selecionada </a>. <br> <strong> Nota: </strong> Nota: </strong> Para cada critério de sucesso da WCAG 2.0, você pode inserir ' Resultados para toda a amostra 'e você pode inserir resultados para páginas individuais. Você pode optar por inserir uma ou ambas. Para inserir resultados individuais, selecione a(s) página(s) da Web em' Amostra a avaliar '(na coluna da esquerda); em seguida, sob os critérios de sucesso específicos, selecione 'Mostrar páginas para inserir resultados individuais'",
    "INTRO_0": "",
    "HD_SAMPLE_SELECT": "Amostra para avaliar",
    "INF_AUDIT_SAMPLE": "Esta seção lista as página selecionadas na etapa anterior. As páginas marcadas nesta seção são listadas quando a opção 'Mostrar páginas para inserir resultados individuais' é ativada na seção 'Critérios de sucesso para avaliar' Você pode mostrar uma página da Web individual que está avaliando ou mostrar várias páginas ao mesmo tempo. <br> O ícone de link em cadeia abre a página da Web em uma janela separada do navegador. ",
    "BTN_COMPLETE_SELECTED": "Conjunto selecionado para concluir",
    "BTN_UNCOMPLETE_SELECTED": "Defina selecionado como incompleto",
    "BTN_OPEN_SELECTED": "Abrir páginas selecionadas",
    "NO_SAMPLE": "Nenhuma amostra disponível. Crie uma amostra nas etapas 2 e 3.",
    "TESTED": "Testado",
    "HD_CRITERIA": "Critérios de Sucesso para Avaliar",
    "INF_AUDIT_CRITERIA": "Esta seção lista os critérios de sucesso das WCAG 2.0. Use o filtro para mostrar ou ocultar critérios de sucesso de diferentes níveis (A, AA e AAA). Você pode selecionar resultados como: 'Não marcado', 'Aprovado', 'Falha', 'Não presente' e 'Não sei'; e você pode fornecer detalhes, comentários ou outras observações feitas durante a avaliação na caixa de texto que o acompanha.",
    "FILTRO": "Filtro",
    "PRINCÍPIO": "Princípio",
    "NOTA": "Nota",
    "BTN_SHOW_TEXT": "Mostrar texto do critério",
    "COMPREENDA": "Compreensão",
    "HOW_TO": "Como conhecer",
    "SAMPLE_FINDINGS": "Resultados para toda a amostra",
    "BTN_EXPAND_PAGES": "Mostrar páginas para inserir resultados individuais",
    "BTN_COLLAPSE_PAGES": "Ocultar páginas para inserir resultados individuais",
    "LABEL_OUTCOME": "Resultado",
    "UNTESTED": "{{critCount}} não testado",
    "NO_PAGE_SELECTED": "Nenhuma página selecionada em Amostra para avaliar",
    "PLH_ASSERT_DESC": "Observações feitas durante a avaliação",
    "CLICK_TO_DELETE": "Clique para excluir",
    "LABEL_PAGE_HANDLE": "Nome curto da página",
    "SELECT_ALL": "Selecione todas as páginas",
    "RESULTS_FOR": "Resultados para"
}
