{
  "TITLE": "Etapa 2: explore o site",
  "INTRO": "Explore o site para entender sua finalidade, funcionalidade e uso. Esta etapa ajuda a determinar quais páginas serão usadas para avaliação nas próximas etapas. Identifique as tecnologias web usadas para fornecer o site e, se desejar , faça anotações sobre outros aspectos do site. Geralmente, é melhor obter informações dos proprietários e desenvolvedores do site para esta etapa. Mais orientações sobre esta etapa são fornecidas na <a href={{link_em_2}}> Etapa 2 da WCAG-EM : Explore o site</a>. ",
  "HD_RELIEDUP_TECH": "Tecnologias da Web confiáveis",
  "INF_RELIEDUP_TECH": "Identifique as tecnologias da web <a href={{link_relied_upon}}> com base nas WCAG 2.0 </a> para fornecer o site. Para obter mais informações, consulte <a href={{link_em_2d}}> WCAG -EM Etapa 2.d: Identifique as tecnologias da Web confiáveis ​​</a>. <br> Nota: Para adicionar outras tecnologias, selecione 'Outros' e use o campo 'Tecnologia da Web' e 'Endereço de especificação (URL)'. O campo Endereço de especificação (URL) 'deve identificar a especificação de tecnologia da Web. ",
  "LABEL_TECH": "Tecnologia da Web",
  "LABEL_TECH_SPEC": "Endereço de especificação (URL)",
  "PLH_TECH": "Por exemplo, HTML5, CSS, DOM",
  "PLH_TECH_SPEC": "Endereço (URL) ou descrição para a especificação da tecnologia",
  "BTN_REMOVE_TECH": "Remover tecnologia",
  "BTN_ADD_TECH": "Adicionar tecnologia",
  "HD_NOTE_TAKING": "Notas opcionais de exploração",
  "INF_NOTE_TAKING": "Esta seção permite registrar informações durante a exploração do site. Essas notas são fornecidas na próxima etapa, para ajudá-lo a selecionar uma amostra de páginas da web para avaliação. <strong> Essas notas não estão incluídas no relatório final. </strong> Eles são salvos quando você salva o arquivo e disponíveis quando você recarrega mais tarde o arquivo ",
  "LABEL_ESSENT_FUNC": "Funcionalidade essencial do site",
  "INF_ESSENT_FUNC": "Você pode usar este campo para fazer anotações sobre as funcionalidades essenciais do site. Exemplos de funcionalidades essenciais incluem: <br> 'selecionando e comprando um produto na área de loja do site' <br> 'preenchendo e enviando um formulário fornecido no site '<br>' registrando-se para uma conta no site '<br> <br> Para obter mais informações, consulte <a href={{link_em_2b}}> WCAG-EM Etapa 2.b: identifique a funcionalidade essencial do Website </a>. ",
  "LABEL_VARIETY_PAGE_TYPES": "Variedade de tipos de páginas",
  "INF_VARIETY_PAGE_TYPES": "Você pode usar este campo para fazer anotações sobre os tipos (em oposição a instâncias) de páginas da Web encontradas no site. Isso inclui notas sobre diferentes estilos, layouts, estruturas e funcionalidades fornecidas no site. Para obter mais informações, consulte <a href={{link_em_2c}}> WCAG-EM Etapa 2.c: identifique a variedade de tipos de páginas da Web </a>. <br> Nota: 'Páginas da Web' incluem diferentes páginas da Web states '; consulte a definição de <a href={{link_page_state}}> estados da página da web </a>. ",
  "LABEL_OTHER": "Outros ..."
}
