{
    "ASSERTION_RESULT_DESCRIPTION_LABEL": "Observations",
    "ASSERTION_RESULT_DESCRIPTION_PLACEHOLDER": "Observations made during evaluation",
    "BTN_COLLAPSE_PAGES": "Hide web pages to enter individual results",
    "BTN_COMPLETE_SELECTED": "Set selected to complete",
    "BTN_EXPAND_PAGES": "Show web pages to enter individual results",
    "BTN_OPEN_SELECTED": "Open selected pages",
    "BTN_SHOW_TEXT": "Show criterion text",
    "BTN_UNCOMPLETE_SELECTED": "Set selected to incomplete",
    "CLICK_TO_DELETE": "Click to delete",
    "FILTER_LEVEL_LEGEND": "Show conformance level",
    "FILTER_NEW_IN_WCAG21": "Added in WCAG 2.1",
    "FILTER_VERSION_LEGEND": "Show version",
    "FILTER": "Show",
    "HD_CRITERIA": "Success Criteria to Evaluate",
    "HD_SAMPLE_SELECT": "Sample to Evaluate",
    "HOW_TO": "How to meet",
    "INF_AUDIT_CRITERIA": "This section lists the WCAG 2 success criteria. Use the filter to show or hide success criteria of different levels (A, AA and AAA). You can select results as: 'Not checked', 'Passed', 'Failed', 'Not present', and 'Cannot tell'; and you can provide details, comments, or other observations made during evaluation in the accompanying text box.",
    "INF_AUDIT_SAMPLE": "This section lists the web pages you selected in the previous step. The web pages that are checked in this section are listed when 'Show web pages to enter individual results' is activated in the 'Success Criteria to Evaluate' section. You can show an individual web page that you are evaluating, or show several web pages at the same time. <br> The chainlink icon opens the web page in a separate browser window.",
    "INTRO": "Record the outcome from evaluating the web pages selected in the previous step. Compare the results between the structured page and randomly selected pages, and if needed, adjust the selected sample in the previous step. More guidance on this step is provided in <a href={{link_em_4}}>WCAG-EM Step 4: Audit the Selected Sample</a>. <br> <strong>Note:</strong> For each WCAG 2 success criteria, you can enter 'Results for the entire sample' and you can enter results for individual web pages. You can choose to enter either or both. To enter individual results, select the web page(s) under 'Sample to Evaluate' (in the left column); then under the specific success criteria, select 'Show web pages to enter individual results'",
    "LABEL_OUTCOME": "Outcome",
    "LABEL_PAGE_HANDLE": "Short page name",
    "NO_PAGE_SELECTED": "No pages selected under Sample to Evaluate",
    "NO_SAMPLE": "No sample available. Create a sample in step 2 and step 3.",
    "NOTE": "Note",
    "PRINCIPLE": "Principle",
    "RESULTS_FOR": "Results for",
    "SAMPLE_FINDINGS": "Results for the entire sample",
    "SELECT_ALL": "Select all web pages",
    "TESTED": "Tested",
    "TITLE": "Step 4: Audit the Selected Sample",
    "UNDERSTAND": "Understanding",
    "UNTESTED": "{{critCount}} untested"
}
