{
    "TITLE": "Step 2: Explore the Target Website",
    "INTRO": "Explore the website to understand its purpose, functionality, and use. This step helps you determine which web pages to use for the evaluation in the next steps. Identify the web technologies used to provide the website and, if you want, take notes on other aspects of the website. Usually it is best to get input from the website owners and developers for this step. More guidance on this step is provided in {0}.",
    "INTRO_0": "WCAG-EM Step 2: Explore the Target Website",
    "HD_RELIEDUP_TECH": "Web Technologies Relied Upon",
    "INF_RELIEDUP_TECH": "Identify the web technologies {1} to provide the website. For more information, see {0}.\n Note: To add other technologies, select 'Others' and use the 'Web Technology' and 'Specification Address (URL)' field. The 'Specification Address (URL)' field should identify the web technology specification.",
    "INF_RELIEDUP_TECH_0": "WCAG-EM Step 2.d: Identify Web Technologies Relied Upon",
    "INF_RELIEDUP_TECH_1": "relied upon according to WCAG 2.0",
    "LABEL_TECH": "Web Technology",
    "LABEL_TECH_SPEC": "Specification Address (URL)",
    "PLH_TECH": "E.g. HTML5, CSS, DOM",
    "PLH_TECH_SPEC": "Address (URL) or description for the web technology specification",
    "BTN_REMOVE_TECH": "Remove technology",
    "BTN_ADD_TECH": "Add web technology",
    "NO_TECH_DEFINED": "No relied upon technologies defined for this list",
    "HD_NOTE_TAKING": "Optional Exploration Notes",
    "INF_NOTE_TAKING": "This section lets you record information during your website exploration. These notes are provided in the next step, to help you select a sample of web pages for evaluation. <strong>These notes are not included in the final report.</strong> They are saved when you save the file, and available when you later reload the file",
    "LABEL_ESSENT_FUNC": "Essential functionality of the website",
    "INF_ESSENT_FUNC": "You can use this field to take notes about essential functionality of the website. Examples of essential functionality include:\n 'selecting and purchasing a product from the shop area of the website'\n 'completing and submitting a form provided on the website'\n 'registering for an account on the website'\n For more information, see {0}.",
    "INF_ESSENT_FUNC_0": "WCAG-EM Step 2.b: Identify Essential Functionality of the Website",
    "LABEL_VARIETY_PAGE_TYPES": "Variety of web page types",
    "INF_VARIETY_PAGE_TYPES": "You can use this field to take notes about the types (as opposed to instances) of web pages that you find on the web site. This includes notes about different styles, layouts, structures, and functionality provided on the website. For more information, see {0}.\n Note: 'Web pages' include different 'web page states'; see definition of {1}.",
    "INF_VARIETY_PAGE_TYPES_0": "WCAG-EM Step 2.c: Identify the Variety of Web Page Types",
    "INF_VARIETY_PAGE_TYPES_1": "web page states",
    "LABEL_OTHER": "Others..."
}