{
    "TITLE": "Step 1: Define the Evaluation Scope",
    "INTRO": "Define the overall parameters and scope of the evaluation. Ideally, this is done with the person who commissioned the evaluation (who may or may not be the website owner), to ensure common expectations about the scope of the evaluation. More guidance on this step is provided in <a href={{link_step1}}>WCAG-EM Step 1: Define the Evaluation Scope</a>.",
    "LABEL_SITE_NAME": "Website name",
    "INF_SITE_NAME": "Provide a name for the website that you would like to evaluate. For example:<br> 'Public Website of Example Organization'<br> 'Webshop of Example Company'<br> 'Intranet of Example University'",
    "LABEL_SITE_SCOPE": "Scope of the website",
    "INF_SITE_SCOPE_0": "Define the scope of the website, so it is clear which web pages are included in the evaluation. For example:",
    "INF_SITE_SCOPE_LI0": "'All web content of the public website of Example Org. located at http://www.example.org'",
    "INF_SITE_SCOPE_LI1": "'All web content of the online shop of Example Org. located at http://www.example.org/shop/'",
    "INF_SITE_SCOPE_LI2": "'All web content of the mobile version of the public website of Example Org. located at http://m.example.org'",
    "INF_SITE_SCOPE_1": "WCAG-EM Step 1.a: Define the Scope of the Website",
    "LABEL_WCAG_VERSION": "WCAG Version",
    "INFO_WCAG_VERSION": "Select the WCAG version to use. Version 2.1 (default) or 2.0",
    "WCAG21": "WCAG 2.1",
    "WCAG20": "WCAG 2.0",
    "LABEL_CONFORMANCE_TGT": "Conformance target",
    "INF_CONF_TGT": "Select a target WCAG 2 conformance level ('A', 'AA', or 'AAA') for the evaluation. For more information, see <a href={{link_em_1b}}>WCAG-EM Step 1.b: Define the Conformance Target</a>. This selection determines which conformance level filters are active by default in 'step 4: Audit the Sample'.",
    "LABEL_SUPPORT_BASE": "Accessibility support baseline",
    "INF_SUPPORT_BASE": "Define the web browsers, assistive technologies, and other <a href={{link_user_agent}}>user agents</a> that will be <a href={{link_access_supp}}>accessibility supported</a> by the website. For example, 'Internet Explorer (IE) with JAWS', 'FireFox with NVDA', and 'Apple with VoiceOver' could be basic definitions. For more information, see <a href={{link_em_step1c}}>WCAG-EM Step 1.c: Define an Accessibility Support Baseline</a>.",
    "LABEL_EXTRA_REQUIREMENTS": "Additional evaluation requirements",
    "INF_EXTRA_REQUIREMENTS_0": "Define any additional evaluation requirements. For example:",
    "INF_EXTRA_REQUIREMENTS_LI0": "'The report will include a list of all errors identified by the evaluator, rather than examples only'",
    "INF_EXTRA_REQUIREMENTS_LI1": "'The report will include a description of the problem and repair suggestions for any errors listed'",
    "INF_EXTRA_REQUIREMENTS_LI2": "'The evaluation will cover all web pages and web content of the website, rather than a selected sample only'",
    "INF_EXTRA_REQUIREMENTS_1": "WCAG-EM Step 1.d: Define Additional Evaluation Requirements"
}
