{
    "TITLE": "WCAG-EM Report Tool",
    "SUBTITLE": "Overzicht",
    "INTRO_HD": "Wat de tool doet",
    "INTRO_1": "Deze tool maakt een rapport op basis van uw bevindingen in toegankelijkheidsonderzoek. Het is gebaseerd op de [Web Content Accessibility Guidelines Evaluation Methodology (WCAG-EM)](https://www.w3.org/TR/WCAG-EM/).",
    "TIPS_HD": "Tips voor het gebruik van deze tool",
    "TIPS_1": "Onder “Bekijk Report”, kunt u uw rapport downloaden als HTML (webpagina) of als JSON (gestructureerde data).",
    "TIPS_2": "U kunt bevindingen beschrijven in  <a href='https://en.wikipedia.org/wiki/Markdown'>Markdown</a>, zodat u bijvoorbeeld lijsten, links en codevoorbeelden kunt toevoegen..",
    "TIPS_3": "Deze tool slaat de informatie die u toevoegt niet automatsch op. OM data op te slaan, gebruik de  Windows sneltoets *ctrl+s* of de Mac sneltoets *cmd+s*. (U kunt het rapport ook opslaan met de knoppen op de 'Bekijk rapport' pagina)",
    "ABOUT_HEADING": "Over deze tool",
    "ABOUT_1": "<p>De WCAG-EM Report Tool is er om een <a href='https://www.w3.org/WAI/eval/report-tool/#!/view_report'>gestructureerd rapport</a> te maken van de bevindingen uit een toegankelijkheidsonderzoek. De tool onderzoekt zelf niets en bevat ook geen automatische tests.</p>",
    "ABOUT_2": "<p>Deze tool is bedoeld voor ervaren toegankelijkheidsonderzoekers. Kennis wordt verondersteld van WCAG, toegankelijk bouwen, hulptechnologieën en van hoe mensen met een functiebeperking het web gebruiken (zoals beschreven in de sectie <a lang='en' href='http://www.w3.org/TR/WCAG-EM/#expertise'>Required Expertise</a> van WCAG-EM.</p>",
    "USAGE_HD": "Hoe deze tool werkt",
    "USAGE_LI1": "Alle functionaliteit is direct in uw webbrowser beschikbaar. U heeft geen internetverbinding nodig vanaf dit punt. Wanneer u het venster van de webbrowser sluit, raken gegevens die u niet heeft bewaard verloren.",
    "USAGE_LI2": "Alle gegevens die u invult worden als JSON data op de achtergrond bewaard (in uw webbrowser, niet op een server). U kunt periodiek opslaan terwijl u werkt, om te voorkomen dat u data verliest mocht uw webbrowser sluiten.",
    "USAGE_LI3": "U kunt tussentijdse rapporten bewaren en er later aan verder werken. Klik op de ‘Open Rapport’ knop op de eerste pagina en laad daar het bestand dat u eerder hebt opgeslagen.",
    "USAGE_LI4": "Links naar externe pagina’s (buiten de tool) openen in een nieuw browser venster.",
    "TIPS_HD": "Tips om de tool te gebruiken",
    "TIPS_LI3": "De tool creëert uw rapport als HTML en CSS bestanden. U kunt deze bestanden downloaden op de ‘Bekijk rapport’-pagina. Daarna kunt u de presentatie en de inhoud van het rapport verder bewerken."
}
