{
    "TITLE": "Stap 5: Evaluatiebevindingen rapporteren",
    "INTRO": "Benoem verdere bevindingen uit de evaluatie die u in het rapport wilt hebben. De toetsresultaten uit de vorige stap vindt u onder 'Uitgebreide toetsresultaten' ter review en om u te helpen bij het schrijven van de samenvatting. Meer informatie over deze stap vindt u in <a href={{link_em_5}}>WCAG-EM Stap 5: Evaluatiebevindingen rapporteren</a>.",
    "LABEL_TITLE": "Rapporttitel",
    "TITLE_PREFIX": "Rapportage van",
    "INF_TITLE": "Vul hier de titel in van het evaluatierapport van de toegankelijkheid van de website. Bijvoorbeeld: <br> 'Evaluatierapport voor Voorbeeldorganisatie' <br> 'Webshop Toegankelijkheidsanalyse en verbetersuggesties'",
    "LABEL_COMMISSIONER": "Evaluatieopdrachtgever",
    "INF_COMMISSIONER": "De persoon, het team, de organisatie, het departement of andere entiteit die opdracht voor de evaluatie gaf.",
    "LABEL_CREATOR": "Evaluator",
    "INF_CREATOR": "De persoon, het team, de organisatie, het departement of andere entiteit verantwoordelijk voor het uitvoeren van de evaluatie.",
    "LABEL_DATE": "Evaluatiedatum",
    "INF_DATE": "Vul hier de datum in waarop de evaluatie werd afgerond, of de datums waarop de evaluatie plaats vond. U kunt elk datumformaat gebruiken.",
    "LABEL_SUMMARY": "Managementsamenvatting",
    "INF_SUMMARY": "Geef een korte samenvatting van de bevindingen uit de evaluatie om zo een overzicht van de resultaten te krijgen. Benoem bijvoorbeeld de algehele toegankelijkheid van de website, met enkele concrete voorbeelden uit het onderzoek, zoals de frequentie van bepaalde verbeterpunten.",
    "LABEL_SPECIFICS": "Benoem de onderbouwing van de evaluatie (optioneel)",
    "INF_SPECIFICS": "WCAG-EM raadt aan dat u de getoetste webpagina's bewaart. Meer informatie hierover vindt u in <a href={{link_em_5b}}>WCAG-EM Stap 5.b: Benoem de onderbouwing van de evaluatie</a>. Gebruik dit tekstveld tevens om de gebruikte evaluatietools, webbrowsers, hulptechnologieën, andere software en toetsmethodes vast te leggen. Dit zal tevens in het eindrapport staan. U kunt deze informatie na het downloaden van het rapport als HTML-bestand nog bijwerken.",
    "HD_CRITERIA_REPORT": "Uitgebreide toetsresultaten"
}