{
    "ASSERTION_RESULT_DESCRIPTION_LABEL": "Obserwacje",
    "ASSERTION_RESULT_DESCRIPTION_PLACEHOLDER": "Obserwacje poczynione podczas oceny",
    "BTN_COLLAPSE_PAGES": "Ukryj strony na wyniki indywidualne",
    "BTN_COMPLETE_SELECTED": "Oznacz zaznaczone jako kompletne",
    "BTN_EXPAND_PAGES": "Pokaż strony na wyniki indywidualne",
    "BTN_OPEN_SELECTED": "Otwórz wybrane strony",
    "BTN_SHOW_TEXT": "Pokaż tekst kryterium",
    "BTN_UNCOMPLETE_SELECTED": "Oznacz zaznaczone jako niekompletne",
    "CLICK_TO_DELETE": "Kliknij, aby usunąć",
    "FILTER_LEVEL_LEGEND": "Pokaż poziom zgodności",
    "FILTER_NEW_IN_WCAG21": "Dodane w WCAG 2.1",
    "FILTER_VERSION_LEGEND": "Pokaż wersję",	
	"FILTER": "Filter",	
    "HD_CRITERIA": "Kryteria sukcesu do oceny",
    "HD_SAMPLE_SELECT": "Próbka do oceny",
    "HOW_TO": "Jak spełnić kryterium",
    "INF_AUDIT_CRITERIA": "W tej sekcji wymieniono kryteria sukcesu WCAG 2 Użyj filtru, aby pokazać lub ukryć kryteria sukcesu różnych poziomów (A, AA i AAA). Możesz ustalić wyniki jako: „Nietestowane”, „Zaliczone”, „Niezaliczone”, „Nie dotyczy” i „Nie można powiedzieć”; w odpowiednim polu tekstowym możesz podać szczegóły, komentarze lub inne uwagi poczynione podczas oceny.",
    "INF_AUDIT_SAMPLE": "W tej sekcji wymieniono strony internetowe wybrane w poprzednim kroku. Strony internetowe zaznaczone w&nbsp;tej sekcji są wymienione, gdy aktywowany jest przycisk „Pokaż strony na wyniki indywidualne” w sekcji „Kryteria sukcesu do oceny”. Możesz wyświetlić pojedynczą stronę internetową, którą oceniasz, lub pokazać kilka stron jednocześnie. <br>Ikona łańcucha otwiera stronę internetową w osobnym oknie przeglądarki.",
    "INTRO_0": "",
    "INTRO": "Zapisz wyniki oceny stron internetowych wybranych w poprzednim kroku. Porównaj wyniki między stronami z próbki strukturalnej oraz losowej i w razie potrzeby dostosuj wybraną próbkę w poprzednim kroku. Więcej wskazówek na temat tego kroku znajduje się w <a href={{link_em_4}}>WCAG-EM Krok 4: Audit the Selected Sample</a> (Audyt wybranej próbki). <br> <strong>Uwaga:</strong> Dla każdego kryterium sukcesu WCAG 2 możesz wpisać „Wyniki dla całej próbki” oraz wyniki dla poszczególnych stron. Możesz wybrać jeden lub oba sposoby notowania wyników. Aby wprowadzić wyniki dla konkretnych stron, wybierz strony w obszarze „Próbka do oceny” (w lewej kolumnie); następnie w ramach konkretnych kryteriów sukcesu wybierz przycisk „Pokaż strony na wyniki indywidualne”",
    "LABEL_OUTCOME": "Wynik",
    "LABEL_PAGE_HANDLE": "Krótka nazwa strony",
    "NO_PAGE_SELECTED": "Brak stron wybranych w części Próbka do oceny",
    "NO_SAMPLE": "Brak dostępnej próbki. Utwórz próbkę w kroku 2 i 3.",
    "NOTE": "Uwaga",
    "PRINCIPLE": "Zasada",
    "RESULTS_FOR": "Wyniki dla",
    "SAMPLE_FINDINGS": "Wyniki dla całej próbki",
    "SELECT_ALL": "Wybierz wszystkie strony internetowe",
    "TESTED": "Testowane",
    "TITLE": "Krok 4: Audyt wybranej próbki",
    "UNDERSTAND": "Objaśnienie",
    "UNTESTED": "{{critCount}} niesprawdzone",
	"LABEL_ASSERT": "Ustalenia",
	"LABEL_DESCR": "Ustalenia",	
    "PLH_ASSERT_DESC": "Obserwacje poczynione podczas oceny"	
}
