{
    "TITLE": "Krok 2: Dokonaj przeglądu witryny",
    "INTRO": "Przejrzyj witrynę, aby zrozumieć jej cel, funkcjonalność i sposób użytkowania. Przegląd witryny pomoże Ci ustalić, które strony internetowe poddać ocenie w&nbsp;kolejnych krokach. Określ technologie internetowe wykorzystane do stworzenia witryny i, jeśli chcesz, zanotuj uwagi na temat innych aspektów witryny. Zazwyczaj najlepiej jest uzyskać informację dotyczące tego kroku od właścicieli i projektantów witryny. Więcej wskazówek o tym etapie znajduje się w <a href={{link_em_2}}>WCAG-EM Step 2: Explore the Target Website</a> (Dokonaj przeglądu witryny).",
    "HD_RELIEDUP_TECH": "Zastosowane technologie internetowe",
    "INF_RELIEDUP_TECH": "Określ, jakie technologie internetowe, <a href={{link_relied_upon}}>do których odwołują się WCAG 2</a>, zastosowano na witrynie. Aby uzyskać więcej informacji, zobacz <a href={{link_em_2d}}>WCAG-EM Step 2.d: Identify Web Technologies Relied Upon</a> (Określ technologie internetowe, na których opiera się witryna).<br> Uwaga: Aby dodać inne technologie, wybierz opcję „Inne” i użyj pól „Technologia internetowa” oraz „Adres specyfikacji (URL)”. Pole „Adres specyfikacji (URL)” powinno określać specyfikację technologii internetowej.",
    "LABEL_TECH": "Technologie internetowe",
    "LABEL_TECH_SPEC": "Adres specyfikacji (URL)",
    "PLH_TECH": "Np. HTML5, CSS, DOM",
    "PLH_TECH_SPEC": "Adres (URL) lub opis specyfikacji technologii internetowej",
    "BTN_REMOVE_TECH": "Usuń technologię",
    "BTN_ADD_TECH": "Dodaj technologię",
    "HD_NOTE_TAKING": "Inne uwagi (opcjonalnie)",
    "INF_NOTE_TAKING": "Ta sekcja umożliwia zanotowanie podczas przeglądu witryny innych uwag istotnych dla oceny witryny. Notatki te zostaną wyświetlone w następnym kroku, aby pomóc Ci wybrać próbkę stron internetowych do oceny. <strong>W raporcie końcowym te uwagi nie zostaną uwzględnione</strong>. Są one zapisywane podczas zapisywania pliku i dostępne podczas ponownego ładowania pliku.",
    "LABEL_ESSENT_FUNC": "Podstawowe funkcjonalności witryny",
    "INF_ESSENT_FUNC": "Możesz użyć tego pola do wypisania podstawowych funkcjonalności witryny. Przykłady takich podstawowych funkcjonalności obejmują:<br>„wybór i zakup produktu w strefie sklepu”,<br> „wypełnienie i przesłanie formularza kontaktowego”,<br>„rejestrację konta użytkownika”.<br>Aby uzyskać więcej informacji, zobacz <a href={{link_em_2b}}>WCAG-EM Step 2.b: Identify Essential Functionality of the Website</a> (Określ podstawowe funkcjonalności witryny).",
    "LABEL_VARIETY_PAGE_TYPES": "Różne typy stron internetowych",
    "INF_VARIETY_PAGE_TYPES": "Możesz użyć tego pola do wynotowania różnych typów stron internetowych, które znajdziesz na witrynie. Zestawienie może objąć różne rodzaje układów, struktur i funkcjonalności, stylów zastosowanych witrynie. Nie wypisuj tutaj wystąpień (instancji) różnych typów, a jedynie ich określenie. Aby uzyskać więcej informacji, zobacz <a href={{link_em_2c}}>WCAG-EM Krok 2.c: Identify the Variety of Web Page Types</a> (Określ różne typy stron internetowych).<br> Uwaga: 'Strony internetowe' obejmują różne „stany stron internetowych”; zobacz definicję <a href={{link_page_state}}>web page states</a> (stanów stron internetowych).",
    "LABEL_OTHER": "Inne..."
}