{
    "TITLE": "Krok 5: Raport ustaleń z oceny",
    "INTRO": "Podaj dodatkowe informacje, które chcesz uwzględnić w raporcie. Aby ułatwić Ci napisanie podsumowania, ustalenia z oceny, które wprowadziłeś w poprzednim kroku, znajdują się poniżej w części „Szczegółowe wyniki audytu”. Więcej wskazówek na ten temat znajduje się w części <a href={{link_em_5}}>WCAG-EM Krok 5: Report the Evaluation Findings</a> (Raport ustaleń z oceny).",
    "LABEL_TITLE": "Tytuł raportu",
    "TITLE_PREFIX": "Raport dla",
    "INF_TITLE": "Podaj tytuł raportu z oceny dostępności witryny. Na przykład:<br> „Raport z oceny Witryny Przykładowej Organizacji”,<br> „Analiza dostępności sklepu internetowego Przykładowej Organizacji i propozycje napraw”",
    "LABEL_COMMISSIONER": "Zlecający ocenę",
    "INF_COMMISSIONER": "Osoba, zespół ludzi, organizacja, dział wewnętrzny lub inny podmiot, który zlecił ocenę",
    "LABEL_CREATOR": "Oceniający",
    "INF_CREATOR": "Osoba, zespół ludzi, organizacja, dział wewnętrzny lub inny podmiot odpowiedzialny za przeprowadzenie oceny.",
    "LABEL_DATE": "Data oceny",
    "INF_DATE": "Podać datę zakończenia lub czas trwania oceny. Możesz użyć dowolnego formatu daty.",
    "LABEL_SUMMARY": "Streszczenie",
    "INF_SUMMARY": "Podaj krótkie podsumowanie ustaleń z oceny, aby dać przegląd wyników. Na przykład, opisz ogólną dostępność witryny i najważniejsze spostrzeżenia (kluczowe obserwacje) poczynione podczas oceny, takie jak często występujące problemy i wzorce projektowe rozwiązań.",
    "LABEL_SPECIFICS": "Zapis szczegółów oceny (opcjonalnie)",
    "INF_SPECIFICS": "WCAG-EM sugeruje udokumentowanie metodyki oceny witryny. Aby uzyskać więcej informacji, zobacz <a href={{link_em_5b}}>WCAG-EM Krok 5.b: Record the Evaluation Specifics</a> (Zapisz specyfikację oceny). W tym polu tekstowym można zapisać narzędzia oceny, przeglądarki internetowe, technologie wspomagające, inne oprogramowanie i metody zastosowane do oceny. To, co tu wpiszesz, zostanie uwzględnione w wygenerowanym raporcie. Po pobraniu raportu i przed przesłaniem go do zleceniodawcy możesz usunąć lub edytować te informacje w pliku HTML.",
    "HD_CRITERIA_REPORT": "Szczegółowe wyniki audytu"
}