{
    "TITLE": "Krok 1: Ustal zakres oceny",
    "INTRO": "Określ ogólne parametry i zakres oceny. Najlepiej, jeśli zrobisz to z osobą, która zleciła ocenę (może to być, ale nie musi, właściciel witryny), aby uwzględnić wszystkie oczekiwania co do zakresu oceny. Więcej wskazówek na ten temat znajduje się na stronie <a href={{link_step1}}>WCAG-EM Krok 1: Define the Evaluation Scope</a> (Ustal zakres oceny).",
    "LABEL_SITE_NAME": "Nazwa witryny",
    "INF_SITE_NAME": "Podaj nazwę witryny, którą będziesz oceniać. Na przykład:<br> „Publiczna witryna Przykładowej organizacji”<br> „Sklep internetowy przykładowej firmy”<br> „Intranet przykładowego uniwersytetu”",
    "LABEL_SITE_SCOPE": "Zakres ocenianych zasobów",
    "INF_SITE_SCOPE_0": "Określ zakres zasobów podlegających ocenie, tak aby było jasne, które strony mają być uwzględnione w ocenie. Na przykład:",
    "INF_SITE_SCOPE_LI0": "„Cała zawartość publicznej strony internetowej Przykładowej organizacji znajdująca się pod adresem http://www.przyklad.org”",
    "INF_SITE_SCOPE_LI1": "„Cała zawartość strony sklepu internetowego Przykładowej organizacji znajdująca się pod adresem http://www.przyklad.org/sklep/”",
    "INF_SITE_SCOPE_LI2": "„Cała zawartość mobilnej wersji publicznej strony internetowej Przykładowej organizacji znajdująca się pod adresem  http://m.przyklad.org”",
    "INF_SITE_SCOPE_1": "WCAG-EM Krok 1.a: Określ zakres stron witryny",
    "LABEL_WCAG_VERSION": "Wersja WCAG",
    "INFO_WCAG_VERSION": "Wybierz wersję WCAG. Wersja 2.1 (domyślnie) lub 2.0",
    "WCAG21": "WCAG 2.1",
    "WCAG20": "WCAG 2.0",
    "LABEL_CONFORMANCE_TGT": "Poziom zgodności",
    "INF_CONF_TGT": "Wybierz docelowy poziom zgodności z WCAG 2 („A”, „AA”, lub „AAA”) do oceny. Aby uzyskać więcej informacji, zobacz <a href={{link_em_1b}}>WCAG-EM Krok 1.b: Define the Conformance Target</a> (Określ wymagany poziom zgodności). Ten wybór decyduje, które filtry poziomu zgodności będą domyślnie aktywne w 'kroku 4: Audyt próbki'.",
    "LABEL_SUPPORT_BASE": "Baza referencyjna technologii obsługujących dostępność",
    "INF_SUPPORT_BASE": "Określ minimalny zestaw kombinacji przeglądarek, technologii wspomagających i innych <a href={{link_user_agent}}>programów klienckich</a> (np. odtwarzaczy mediów), które pozwalają zadeklarować, że witryna <a href={{link_access_supp}}>wspiera dostępność</a>.  Na przykład, „FireFox z NVDA”, „Internet Explorer (IE) z JAWS” i „Apple z VoiceOver” mogą być takim podstawowym zestawem. Więcej informacji można znaleźć w części <a href={{link_em_step1c}}>WCAG-EM Krok 1.c: Define an Accessibility Support Baseline</a> (Określ zestaw technologii bazowych obsługujących dostępność).",
    "LABEL_EXTRA_REQUIREMENTS": "Dodatkowe wymagania dotyczące oceny",
    "INF_EXTRA_REQUIREMENTS_0": "Określ wszelkie dodatkowe wymagania dotyczące oceny. Na przykład:",
    "INF_EXTRA_REQUIREMENTS_LI0": "„Raport będzie zawierał listę wszystkich błędów zidentyfikowanych przez oceniającego, a nie tylko listę przykładów.”",
    "INF_EXTRA_REQUIREMENTS_LI1": "„Raport będzie zawierał opisy problemów i sugestie dotyczące naprawy wszelkich wymienionych błędów.”",
    "INF_EXTRA_REQUIREMENTS_LI2": "„Ocena obejmie wszystkie strony i całą zawartość witryny, a nie tylko wybraną próbkę stron.”",
    "INF_EXTRA_REQUIREMENTS_1": "WCAG-EM Krok 1.d: Define Additional Evaluation Requirements (Określ dodatkowe wymagania oceny)"
}
