{
    "TITLE": "WCAG-EM. Generator raportów",
    "SUBTITLE": "Generator raportów z oceny dostępności stron internetowych",
    "INTRO_HD": "Co robi to narzędzie",
    "INTRO_1": "Generator pomaga wygenerować raport zgodnie z <a href={{link_wcagem}}>Metodologią oceny zgodności stron internetowych z wymaganiami dostepności (WCAG-EM)</a>. Generator nie przeprowadza żadnych testów dostępności. Pomaga jedynie podążać za krokami WCAG-EM, aby wygenerować <a href={{link_report}}>ustrukturyzowany raport</a> z danych, które wprowadzisz. Generator jest przeznaczony dla doświadczonych audytorów, którzy znają <a href={{link_wcag}}>Wytyczne dotyczące dostępności stron internetowych (WCAG) 2</a> i są nieco zaznajomieni z WCAG-EM. Więcej informacji o WCAG-EM, zobacz <a href={{link_conformance}}>WCAG-EM Overview</a> (WCAG-EM Przegląd).",
    "INTRO_2": "<strong>Uwaga:</strong> Generator nie zapisuje wprowadzanych informacji automatycznie. Aby zapisać dane w pliku lokalnie na swoim komputerze, użyj klawiszy skrótów Windows Ctrl+S lub Mac {{mac}}, co spowoduje zapisanie w domyślnym katalogu pliku w formacie JSON. (Możesz też skorzystać z łącza „Zapisz” na górze strony, aby otworzyć stronę Zapisz raport z oceny, a następnie kliknąć łącze „Zapisz plik z danymi lokalnie na swoim komputerze”.)",
    "USAGE_HD": "Jak to narzędzie działa",
    "USAGE_LI1": "Wszystkie funkcje dostarczane przez to narzędzie są ładowane i uruchamiane lokalnie w przeglądarce internetowej. Nie potrzebujesz połączenia internetowego poza tym punktem. Po zamknięciu okna przeglądarki internetowej wszelkie niezapisane dane zostają utracone.",
    "USAGE_LI2": "Wszystkie dane wprowadzone za pomocą Generatora są zapisywane w przeglądarce internetowej (a nie na żadnym serwerze) jako dane JSON. Raporty można zapisywać okresowo w trakcie pracy, aby uniknąć utraty danych w przypadku zamknięcia przeglądarki internetowej.",
    "USAGE_LI3": "Możesz zapisać częściowo wypełnione raporty i pracować nad nimi później. Aby ponownie załadować zapisany plik, użyj łącza „Otwórz” u góry i znajdź wcześniej zapisany plik.",
    "USAGE_LI4": "Łącza, które nie są częścią nawigacji lub funkcjonalności (łącza do zasobów zewnętrznych), otwierają się w nowych oknach przeglądarki internetowej",
    "TIPS_HD": "Wskazówki dotyczące korzystania z Generatora",
    "TIPS_LI1": "Możesz przechodzić między krokami w dowolnej kolejności. Żadne z pól nie jest wymagane.",
    "TIPS_LI2": "Aby uzyskać więcej informacji na temat pola, wybierz ikonę {{info}} obok etykiety pola.",
    "TIPS_LI3": "Generator tworzy raport w postaci plików HTML i CSS. Pliki te można pobrać ze strony „Zobacz raport”. Później możesz zmienić zawartość raportu i wygląd graficzny.",
    "TIPS_LI4": "Możesz uwzględnić w swoim raporcie kryteria sukcesu WCAG 2 wykraczające poza wymagany poziom zgodności. Na przykład, od strony wymagana jest zgodność z kryteriami sukcesu tylko na poziomie AA, ale chcesz również uwzględnić w raporcie kryteria sukcesu na poziomie AAA. W kroku 4 użyj filtra poziomu, aby wyświetlić kryteria wyższego poziomu. Wszystkie kryteria z odnotowanym wynikiem zostaną uwzględniane w raporcie."
}
