{
    "TITLE": "WCAG-EM Report Tool",
    "SUBTITLE": "Overview",
    "INTRO_HD": "What this tool does",
    "INTRO_1": "WCAG-EM Report Tool turns your accessibility evaluation findings into a report. It is based on the Web Content Accessibility Guidelines Evaluation Methodology ([WCAG-EM](https://www.w3.org/TR/WCAG-EM/)).",
    "INTRO_2": "<p>Tips for using this tool:</p><ul><li>Under “View Report”, you can export your report as HTML (web page) or as JSON (structured data).</li><li>You can format your findings with <a href='https://en.wikipedia.org/wiki/Markdown'>Markdown</a>, to add lists, links and code examples and more.</li></ul>",
    "ABOUT_HEADING": "About this tool",
    "ABOUT_1": "<p>The WCAG-EM Report Tool can be used to create a <a href='https://www.w3.org/WAI/eval/report-tool/#!/view_report'>structured report</a> of accessibility evaluation findings. It does not perform (automated) checks.</p>",
    "ABOUT_2": "<p>This tool is for experienced accessibility evaluators. You will need knowledge of WCAG, accessible web design, assistive technologies, and how people with different disabilities use the Web (as described in the WCAG-EM <a href='http://www.w3.org/TR/WCAG-EM/#expertise'>Required Expertise</a> section).</p>",
    "USAGE_HD": "How this tool works",
    "USAGE_LI1": "All functionality provided by this tool is now loaded. It runs locally in your web browser. You don’t need an Internet connection beyond this point. When you close your web browser window, any unsaved data is lost.",
    "USAGE_LI2": "All input is recorded as JSON data in the background (in your web browser, not on any server). You can download your report periodically as you work to avoid losing data if your web browser closes.",
    "USAGE_LI3": "You can save partially-complete reports and work on them later. To reload a saved file, use the ‘Open’ link at the top and find the file that you previously saved.",
    "USAGE_LI4": "This tool does not automatically save the information that you enter. To save your data in a file locally on your computer, use Windows shortcut keys *ctrl+s* or Mac shortcut keys *cmd+s* to open the Save dialog. (Or the ‘Save’ link at the top of the page will open the Save Evaluation Report page and from there the 'Save data file locally to your computer' link will open the Save dialog.)",
    "CHOICES_HEADING": "Result Choices",
    "CHOICES_INTRO": " As you go through and evaluate your tool, you will select a “result” for each criterion. Here is the legend of what those selections mean:",
    "CHOICES_DT1": "Not checked",
    "CHOICES_DD1": "You did not check this success criterion.",
    "CHOICES_DT2": "Pass",
    "CHOICES_DD2": "This success criterion is met.",
    "CHOICES_DT3": "Failed",
    "CHOICES_DD3": "This success criterion is not met.",
    "CHOICES_DT4": "Not applicable",
    "CHOICES_DD4": "This success criterion relates to a feature the authoring tool does not have, it does not apply. ",
    "CHOICES_DT5": "Cannot tell",
    "CHOICES_DD5": "It is unclear whether the success criterion is met."
}
